//1. data
//2. mycharts
//3. 古诗的dataset

poets_dataset = {"柳树": {"爱情": ["花红易衰似郎意，水流无限似侬愁。江上朱楼新雨晴，瀼西春水縠文生。桥东桥西好杨柳，人来人去唱歌行。日出三竿春雾消，江头蜀客驻兰桡。", "马嵬坡下泥土中，不见玉颜空死处。君臣相顾尽沾衣，东望都门信马归。归来池苑皆依旧，太液芙蓉未央柳。芙蓉如面柳如眉，对此如何不泪垂。", "君臣相顾尽沾衣，东望都门信马归。归来池苑皆依旧，太液芙蓉未央柳。芙蓉如面柳如眉，对此如何不泪垂。春风桃李花开日，秋雨梧桐叶落时。", "莫言自古皆如此，健剑刜钟铅绕指。三秋庭绿尽迎霜，惟有荷花守红死。庐江小吏朱斑轮，柳缕吐芽香玉春。两股金钗已相许，不令独作空成尘。", "杨柳千条拂面丝，绿烟金穗不胜吹。香随静婉歌尘起，影伴娇娆舞袖垂。羌管一声何处曲，流莺百啭最高枝。千门九陌花如雪，飞过宫墙两自知。", "昨夜夜半，枕上分明梦见。语多时。依旧桃花面，频低柳叶眉。半羞还半喜，欲去又依依。觉来知是梦，不胜悲。"], "赞美": ["东望望春春可怜，更逢晴日柳含烟。宫中下见南山尽，城上平临北斗悬。细草偏承回辇处，轻花微落奉觞前。宸游对此欢无极，鸟哢声声入管弦。", "陶令日日醉，不知五柳春。素琴本无弦，漉酒用葛巾。清风北窗下，自谓羲皇人。何时到栗里，一见平生亲。", "从来此地夸羊酪，自有莼羹定却人。。春流送客不应赊，南入徐州见柳花。朱雀桥边看淮水，乌衣巷里问王家。", "日暮堂前花蕊娇，争拈小笔上床描。 绣成安向春园里，引得黄莺下柳条。"], "友情": ["渭城朝雨浥轻尘，客舍青青柳色新。劝君更尽一杯酒，西出阳关无故人。", "何必长从七贵游，劳生徒聚万金产。挹君去，长相思，云游雨散从此辞。欲知怅别心易苦，向暮春风杨柳丝。。", "岸雨过城头，黄鹂上戍楼。塞花飘客泪，边柳挂乡愁。白发悲明镜，青春换敝裘。君从万里使，闻已到瓜州。", "黄鸟翩翩杨柳垂，春风送客使人悲。怨别自惊千里外，论交却忆十年时。云开汶水孤帆远，路绕梁山匹马迟。此地从来可乘兴，留君不住益凄其。", "高馆张灯酒复清，夜钟残月雁归声。只言啼鸟堪求侣，无那春风欲送行。黄河曲里沙为岸，白马津边柳向城。莫怨他乡暂离别，知君到处有逢迎。"], "励志": ["。新丰美酒斗十千，咸阳游侠多少年。相逢意气为君饮，系马高楼垂柳边。 出身仕汉羽林郎，初随骠骑战渔阳。"], "闲适": ["陶令日日醉，不知五柳春。素琴本无弦，漉酒用葛巾。清风北窗下，自谓羲皇人。何时到栗里，一见平生亲。"], "抒怀": ["羞见秋眉换新绿，二十男儿那刺促？。南风吹山作平地，帝遣天吴移海水。王母桃花千遍红，彭祖巫咸几回死？青毛骢马参差钱，娇春杨柳含缃烟。筝人劝我金屈卮，神血未凝身问谁？不须浪饮丁都护，世上英雄本无主。", "带雪梅初暖，含烟柳尚青。来窥童子偈，得听法王经。会理知无我，观空厌有形。迷心应觉悟，客思未遑宁。", "函谷忽惊胡马来，秦宫桃李向明开。我愁远谪夜郎去，何日金鸡放赦回？。昔在长安醉花柳，五侯七贵同杯酒。气岸遥凌豪士前，风流肯落他人后？夫子红颜我少年，章台走马著金鞭。", "川明气已变，岩寒云尚拥。南亭草心绿，春塘泉脉动。景煦听禽响，雨余看柳重。逍遥池馆华，益愧专城宠。", "此地曾居住，今来宛似归。可怜汾上柳，相见也依依。"], "思乡": ["马上逢寒食，愁中属暮春。可怜江浦望，不见洛阳人。北极怀明主，南溟作逐臣。故园肠断处，日夜柳条新。", "乡心新岁切，天畔独潸然。老至居人下，春归在客先。岭猿同旦暮，江柳共风烟。已似长沙傅，从今又几年。", "独有宦游人，偏惊物候新。云霞出海曙，梅柳渡江春。淑气催黄鸟，晴光转绿蘋。忽闻歌古调，归思欲沾巾。", "葡萄美酒夜光杯，欲饮琵琶马上催。醉卧沙场君莫笑，古来征战几人回? 秦中花鸟已应阑，塞外风沙犹自寒。夜听胡笳折杨柳，教人意气忆长安。", "谁家玉笛暗飞声，散入春风满洛城。 此夜曲中闻折柳，何人不起故园情。"], "思念": ["今年游寓独游秦，愁思看春不当春。上林苑里花徒发，细柳营前叶漫新。公子南桥应尽兴，将军西第几留宾。寄语洛城风日道，明年春色倍还人。", "杨柳渡头行客稀，罟师荡桨向临圻。 唯有相思似春色，江南江北送君归。", "闻道春还未相识，走傍寒梅访消息。昨夜东风入武阳，陌头杨柳黄金色。碧水浩浩云茫茫，美人不来空断肠。预拂青山一片石，与君连日醉壶觞。", "。人日题诗寄草堂，遥怜故人思故乡。柳条弄色不忍见，梅花满枝空断肠。身在远藩无所预，心怀百忧复千虑。", "烟水初销见万家，东风吹柳万条斜。 大堤欲上谁相伴，马踏春泥半是花。"], "送别": ["关山客子路，花柳帝王城。此中一分手，相顾怜无声。", "边烽警榆塞，侠客度桑干。柳叶开银镝，桃花照玉鞍。 满月临弓影，连星入剑端。不学燕丹客，空歌易水寒。", "御跸下都门，军麾出塞垣。长杨跨武骑，细柳接戎轩。 睿曲风云动，边威鼓吹喧。坐帷将阃外，俱是报明恩。", "怜君不得意，况复柳条春。为客黄金尽，还家白发新。五湖三亩宅，万里一归人。知祢不能荐，羞为献纳臣。", "天官动将星，汉上柳条青。万里鸣刁斗，三军出井陉。忘身辞凤阙，报国取龙庭。岂学书生辈，窗间老一经。"], "孤寂": ["寓居湘岸四无邻，世网难婴每自珍。莳药闲庭延国老，开樽虚室值贤人。泉回浅石依高柳，径转垂藤闲绿筠。 闻道偏为五禽戏，出门鸥鸟更相亲。"], "愁苦": [], "忧国忧民": ["淫乐意何极，金舆向回中。万乘出黄道，千旗扬彩虹。前军细柳北，后骑甘泉东。岂问渭川老，宁邀襄野童。", "临水狎渔樵，望山怀隐沦。谁能去京洛，憔悴对风尘。朝景入平川，川长复垂柳。遥看魏公墓，突兀前山后。"], "咏史怀古": ["北堂夜夜人如月，南陌朝朝骑似云。南陌北堂连北里，五剧三条控三市。弱柳青槐拂地垂，佳气红尘暗天起。汉代金吾千骑来，翡翠屠苏鹦鹉杯。", "铁马云雕久绝尘，柳营高压汉营春。天清杀气屯关右，夜半妖星照渭滨。下国卧龙空寤主，中原逐鹿不由人。象床锦帐无言语，从此谯周是老臣。", "江雨霏霏江草齐，六朝如梦鸟空啼。 无情最是台城柳，依旧烟笼十里堤。"], "壮志难酬": ["侯门辞必服，忍位取悲增。去鲁心犹在，从周力未能。家山余五柳，人世遍千灯。莫让金钱施，无生道自弘。"], "讽刺": ["春城无处不飞花，寒食东风御柳斜。 日暮汉宫传蜡烛，轻烟散入五侯家。", "百官朝下五门西。尘起春风过玉堤。黄帕盖鞍呈了马，红罗系项斗回鸡。馆松枝重墙头出，御柳条长水面齐。唯有教坊南草绿，古苔阴地冷凄凄。", "此地曾经翠辇过，浮云流水竟如何？香销南国美人尽，怨入东风芳草多。残柳宫前空露叶，夕阳川上浩烟波。行人遥起广陵思，古渡月明闻棹歌。", "隋堤柳，汴河旁，夹岸绿阴千里。龙舟凤舸木兰香，锦帆张。因梦江南春景好，一路流苏羽葆。笙歌未尽起横流，锁春愁。"]}, "李": {"爱情": ["好乘浮云骢，佳期兰渚东。鸳鸯绿浦上，翡翠锦屏中。自怜十五馀，颜色桃李红。那作商人妇，愁水复愁风。", "巫峡苍苍烟雨时，清猿啼在最高枝。个里愁人肠自断，由来不是此声悲。山上层层桃李花，云间烟火是人家。银钏金钗来负水，长刀短笠去烧畲。", "归来池苑皆依旧，太液芙蓉未央柳。芙蓉如面柳如眉，对此如何不泪垂。春风桃李花开日，秋雨梧桐叶落时。西宫南内多秋草，落叶满阶红不扫。"], "赞美": ["世人种桃李，皆在金张门。攀折争捷径，及此春风暄。一朝天霜下，荣耀难久存。安知南山桂，绿叶垂芳根。清阴亦可托，何惜树君园。", "绿野堂开占物华，路人指道令公家。令公桃李满天下，何用堂前更种花。"], "友情": ["他人方寸间，山海几千重。轻言托朋友，对面九疑峰。开花必早落，桃李不如松。管鲍久已死，何人继其踪。", "李白乘舟将欲行，忽闻岸上踏歌声。桃花潭水深千尺，不及汪伦送我情。", "不愿论簪笏，悠悠沧海情。。李侯有佳句，往往似阴铿。余亦东蒙客，怜君如弟兄。", "一篇长恨有风情，十首秦吟近正声。每被老元偷格律，苦教短李伏歌行。世间富贵应无分，身后文章合有名。莫怪气粗言语大，新排十五卷诗成。"], "励志": ["含光混世贵无名，何用孤高比云月？吾观自古贤达人，功成不退皆殒身。子胥既弃吴江上，屈原终投湘水滨。陆机雄才岂自保？李斯税驾苦不早。华亭鹤唳讵可闻？上蔡苍鹰何足道？君不见吴中张翰称达生，秋风忽忆江东行。", "。太华生长松，亭亭凌霜雪。天与百尺高，岂为微飙折？桃李卖阳艳，路人行且迷。春光扫地尽，碧叶成黄泥。", "天与百尺高，岂为微飙折？桃李卖阳艳，路人行且迷。春光扫地尽，碧叶成黄泥。愿君学长松，慎勿作桃李。受屈不改心，然后知君子。", "关山难越，谁悲失路之人；萍水相逢，尽是他乡之客。怀帝阍而不见，奉宣室以何年？　　嗟乎！时运不齐，命途多舛。冯唐易老，李广难封。屈贾谊于长沙，非无圣主；窜梁鸿于海曲，岂乏明时？所赖君子见机，达人知命。"], "闲适": ["清溪一道穿桃李，演漾绿蒲涵白芷。溪上人家凡几家，落花半落东流水。蹴踘屡过飞鸟上，秋千竞出垂杨里。少年分日作遨游，不用清明兼上巳。"], "抒怀": ["文章献纳麒麟殿，歌舞淹留玳瑁筵。与君自谓长如此，宁知草动风尘起。函谷忽惊胡马来，秦宫桃李向明开。我愁远谪夜郎去，何日金鸡放赦回？。", "宁期此地忽相遇，惊喜茫如堕烟雾。玉箫金管喧四筵，苦心不得申长句。 昨日绣衣倾绿尊，病如桃李竟何言。昔骑天子大宛马，今乘款段诸侯门。", "古称寿圣人，曾不留至今。但愿得美酒，朋友常共斟。是时春向暮，桃李生繁阴。日照天正绿，杳杳归鸿吟。", "一篇长恨有风情，十首秦吟近正声。每被老元偷格律，苦教短李伏歌行。世间富贵应无分，身后文章合有名。莫怪气粗言语大，新排十五卷诗成。", " 云门寺外逢猛雨，林黑山高雨脚长。曾奉郊宫为近侍，分明??羽林枪。李白题诗水西寺，古木回岩楼阁风。半醒半醉游三日，红白花开山雨中。"], "思乡": [], "思念": ["好乘浮云骢，佳期兰渚东。鸳鸯绿浦上，翡翠锦屏中。自怜十五馀，颜色桃李红。那作商人妇，愁水复愁风。"], "送别": ["古木官渡平，秋城邺宫故。 想君行县日，其出从如云。遥思魏公子，复忆李将军。。", "李白乘舟将欲行，忽闻岸上踏歌声。桃花潭水深千尺，不及汪伦送我情。", "本无轩裳契，素以烟霞亲。尝恨迫世网，铭意俱未伸。松柏虽寒苦，羞逐桃李春。悠悠市朝间，玉颜日缁磷。", "却思恶溪去，宁惧恶溪恶。 咆哮七十滩，水石相喷薄。路创李北海，岩开谢康乐。 松风和猿声，搜索连洞壑。", "控弦尽用阴山儿，登阵常骑大宛马。银鞍玉勒绣蝥弧，每逐嫖姚破骨都。李广从来先将士，卫青未肯学孙吴。传有沙场千万骑，昨日边庭羽书至。"], "孤寂": [], "愁苦": [], "忧国忧民": ["三十六离宫，楼台与天通。阁道步行月，美人愁烟空。恩疏宠不及，桃李伤春风。淫乐意何极，金舆向回中。"], "咏史怀古": ["隐隐朱城临玉道，遥遥翠幰没金堤。挟弹飞鹰杜陵北，探丸借客渭桥西。俱邀侠客芙蓉剑，共宿娼家桃李蹊。娼家日暮紫罗裙，清歌一啭口氛氲。", "关山难越，谁悲失路之人；萍水相逢，尽是他乡之客。怀帝阍而不见，奉宣室以何年？　　嗟乎！时运不齐，命途多舛。冯唐易老，李广难封。屈贾谊于长沙，非无圣主；窜梁鸿于海曲，岂乏明时？所赖君子见机，达人知命。"], "壮志难酬": [], "讽刺": ["入市虽求利，怜君意独真。欲将寒涧树，卖与翠楼人。瘦叶几经雪，淡花应少春。长安重桃李，徒染六街尘！"]}, "杨树": {"爱情": ["垂钓绿湾春，春深杏花乱。潭清疑水浅，荷动知鱼散。日暮待情人，维舟绿杨岸。", "啄食饮泉勇气满，争雄斗死绣颈断。雉子班奏急管弦，倾心酒美尽玉碗。枯杨枯杨尔生稊，我独七十而孤栖。弹弦写恨意不尽，瞑目归黄泥。", "花红易衰似郎意，水流无限似侬愁。江上朱楼新雨晴，瀼西春水縠文生。桥东桥西好杨柳，人来人去唱歌行。日出三竿春雾消，江头蜀客驻兰桡。", "。汉皇重色思倾国，御宇多年求不得。杨家有女初长成，养在深闺人未识。天生丽质难自弃，一朝选在君王侧。", "多羞钗上燕，真愧镜中鸾。归去横塘晓，华星送宝鞍。何处哀筝随急管，樱花永巷垂杨岸。东家老女嫁不售，白日当天三月半。"], "赞美": ["月明关山苦，水剧陇头悲。借问几时还，春风入黄池。无令长相忆，折断绿杨枝。。"], "友情": ["杨花落尽子规啼，闻道龙标过五溪。我寄愁心与明月，随风直到夜郎西。", "时时出向城西曲，晋祠流水如碧玉。浮舟弄水箫鼓鸣，微波龙鳞莎草绿。兴来携妓恣经过，其若杨花似雪何！红妆欲醉宜斜日，百尺清潭写翠娥。翠娥婵娟初月辉，美人更唱舞罗衣。", "翠娥婵娟初月辉，美人更唱舞罗衣。清风吹歌入空去，歌曲自绕行云飞。此时行乐难再遇，西游因献《长杨赋》。北阙青云不可期，东山白首还归去。", "忘忧或假草，满院罗丛萱。暝色湖上来，微雨飞南轩。故人宿茅宇，夕鸟栖杨园。还惜诗酒别，深为江海言。", "何必长从七贵游，劳生徒聚万金产。挹君去，长相思，云游雨散从此辞。欲知怅别心易苦，向暮春风杨柳丝。。", "黄鸟翩翩杨柳垂，春风送客使人悲。怨别自惊千里外，论交却忆十年时。云开汶水孤帆远，路绕梁山匹马迟。此地从来可乘兴，留君不住益凄其。"], "励志": ["非谢家之宝树，接孟氏之芳邻。他日趋庭，叨陪鲤对；今兹捧袂，喜托龙门。杨意不逢，抚凌云而自惜；钟期既遇，奏流水以何惭？　　呜乎！胜地不常，盛筵难再；兰亭已矣，梓泽丘墟。临别赠言，幸承恩于伟饯；登高作赋，是所望于群公。", "王杨卢骆当时体，轻薄为文哂未休。尔曹身与名俱灭，不废江河万古流。"], "闲适": ["清溪一道穿桃李，演漾绿蒲涵白芷。溪上人家凡几家，落花半落东流水。蹴踘屡过飞鸟上，秋千竞出垂杨里。少年分日作遨游，不用清明兼上巳。"], "抒怀": ["羞见秋眉换新绿，二十男儿那刺促？。南风吹山作平地，帝遣天吴移海水。王母桃花千遍红，彭祖巫咸几回死？青毛骢马参差钱，娇春杨柳含缃烟。筝人劝我金屈卮，神血未凝身问谁？不须浪饮丁都护，世上英雄本无主。", "。旷野饶悲风，飕飕黄蒿草。系马倚白杨，谁知我怀抱。 所是同袍者，相逢尽衰老。", "白玉一杯酒，绿杨三月时。春风余几日，两鬓各成丝。秉烛唯须饮，投竿也未迟。如逢渭水猎，犹可帝王师。", "世人遇我同众人，唯君于我最相亲。且喜百年见交态，未尝一日辞家贫。弹棋击筑白日晚，纵酒高歌杨柳春。欢娱未尽分散去，使我惆怅惊心神。", "垂杨叶老莺哺儿，残丝欲断黄蜂归。绿鬓年少金钗客，缥粉壶中沉琥珀。花台欲暮春辞去，落花起作回风舞。 榆荚相催不知数，沈郎青钱夹城路。"], "思乡": ["葡萄美酒夜光杯，欲饮琵琶马上催。醉卧沙场君莫笑，古来征战几人回? 秦中花鸟已应阑，塞外风沙犹自寒。夜听胡笳折杨柳，教人意气忆长安。", "杨花落尽子规啼，闻道龙标过五溪。我寄愁心与明月，随风直到夜郎西。", "杨柳阴阴细雨晴，残花落尽见流莺。春风一夜吹乡梦，又逐春风到洛城。", "乌啼鹊噪昏乔木，清明寒食谁家哭。风吹旷野纸钱飞，古墓垒垒春草绿。棠梨花映白杨树，尽是死生别离处。冥冥重泉哭不闻，萧萧暮雨人归去。", "黄河远上白云间，一片孤城万仞山。羌笛何须怨杨柳，春风不度玉门关。"], "思念": ["杨柳渡头行客稀，罟师荡桨向临圻。 唯有相思似春色，江南江北送君归。", "垂杨拂绿水，摇艳东风年。花明玉关雪，叶暖金窗烟。美人结长想，对此心凄然。攀条折春色，远寄龙庭前。", "闻道春还未相识，走傍寒梅访消息。昨夜东风入武阳，陌头杨柳黄金色。碧水浩浩云茫茫，美人不来空断肠。预拂青山一片石，与君连日醉壶觞。", "凤尾香罗薄几重，碧文圆顶夜深缝。扇裁月魄羞难掩，车走雷声语未通。曾是寂寥金烬暗，断无消息石榴红。斑骓只系垂杨岸，何处西南任好风。"], "送别": ["御跸下都门，军麾出塞垣。长杨跨武骑，细柳接戎轩。 睿曲风云动，边威鼓吹喧。坐帷将阃外，俱是报明恩。", "杨柳渡头行客稀，罟师荡桨向临圻。 唯有相思似春色，江南江北送君归。", "花映垂杨汉水清，微风林里一枝轻。即今江北还如此，愁杀江南离别情。", "当昔襄阳雄盛时，山公常醉习家池。池边钓女日相随，妆成照影竟来窥。澄波澹澹芙蓉发，绿岸参参杨柳垂。一朝物变人亦非，四面荒凉人住稀。", "斗酒渭城边，垆头耐醉眠。梨花千树雪，杨叶万条烟。惜别添壶酒，临岐赠马鞭。看君颍上去，新月到家圆。"], "孤寂": ["空江浩荡景萧然，尽日菰蒲泊钓船。青草浪高三月渡，绿杨花扑一溪烟。情多莫举伤春目，愁极兼无买酒钱。犹有渔人数家住，不成村落夕阳边。"], "愁苦": ["花映垂杨汉水清，微风林里一枝轻。即今江北还如此，愁杀江南离别情。"], "忧国忧民": ["三吴邦伯多顾盼，四海雄侠皆相推。萧曹曾作沛中吏，攀龙附凤当有时。溧阳酒楼三月春，杨花漠漠愁杀人。胡人绿眼吹玉笛，吴歌白纻飞梁尘。", "老人言，君听取。君不闻开元宰相宋开府，不赏边功防黩武。又不闻天宝宰相杨国忠，欲求恩幸立边功。边功未立生人怨，请问新丰折臂翁。"], "咏史怀古": ["非谢家之宝树，接孟氏之芳邻。他日趋庭，叨陪鲤对；今兹捧袂，喜托龙门。杨意不逢，抚凌云而自惜；钟期既遇，奏流水以何惭？　　呜乎！胜地不常，盛筵难再；兰亭已矣，梓泽丘墟。临别赠言，幸承恩于伟饯；登高作赋，是所望于群公。"], "壮志难酬": [], "讽刺": ["行至上留田，孤坟何峥嵘。积此万古恨，春草不复生。悲风四边来，肠断白杨声。借问谁家地，埋没蒿里茔。", "箫鼓哀吟感鬼神，宾从杂遝实要津。后来鞍马何逡巡，当轩下马入锦茵。杨花雪落覆白苹，青鸟飞去衔红巾。炙手可热势绝伦，慎莫近前丞相嗔！。", "紫泉宫殿锁烟霞，欲取芜城作帝家。玉玺不缘归日角，锦帆应是到天涯。于今腐草无萤火，终古垂杨有暮鸦。地下若逢陈后主，岂宜重问后庭花。", "玉树歌阑海云黑，花庭忽作青芜国。秦淮有水水无情，还向金陵漾春色。杨家二世安九重，不御华芝嫌六龙。百幅锦帆风力满，连天展尽金芙蓉。"]}, "茶": {"爱情": ["今日菖蒲花，明朝枫树老。。妾家住横塘，红纱满桂香。青云教绾头上髻，明月与作耳边珰。", "楼响将登怯，帘烘欲过难。多羞钗上燕，真愧镜中鸾。归去横塘晓，华星送宝鞍。何处哀筝随急管，樱花永巷垂杨岸。", "铜簧韵脆锵寒竹，新声慢奏移纤玉。眼色暗相钩，秋波横欲流。雨云深绣户，来便谐衷素。宴罢又成空，魂迷春梦中。"], "赞美": ["宁知班定远，犹是一书生。。忽闻天上将，关塞重横行。始返楼兰国，还向朔方城。", "碧水澄潭映远空，紫云香驾御微风。汉家城阙疑天上，秦地山川似镜中。向浦回舟萍已绿，分林蔽殿槿初红。古来徒奏横汾曲，今日宸游圣藻雄。", "羽化如可作，相携上清都。。周子横山隐，开门临城隅。连峰入户牖，胜概凌方壶。", "。君即刘越石，雄豪冠当时。凄清横吹曲，慷慨扶风词。虎啸俟腾跃，鸡鸣遭乱离。", "秉钺有季公，凛然负英姿。寄深且戎幕，望重必台司。感激一然诺，纵横两无疑。伏奏归北阙，鸣驺忽西驰。", "慢脸娇娥纤复秾，轻罗金缕花葱茏。回裾转袖若飞雪，左鋋右鋋生旋风。琵琶横笛和未匝，花门山头黄云合。忽作出塞入塞声，白草胡沙寒飒飒。"], "友情": ["餐霞楼上动仙乐，嘈然宛似鸾凤鸣。袖长管催欲轻举，汉东太守醉起舞。手持锦袍覆我身，我醉横眠枕其股。当筵意气凌九霄，星离雨散不终朝，分飞楚关山水遥。", "青山横北郭，白水绕东城。此地一为别，孤蓬万里征。浮云游子意，落日故人情。挥手自兹去，萧萧班马鸣。", "侧叠万古石，横为白马矶。乱流若电转，举掉扬珠辉。临驿卷缇幕，升堂接绣衣。情亲不避马，为我解霜威。", "加以尖山万重，平地卓立。黑是铁色，锐如笔锋。复有阳江、桂江，略军城而南走，喷入沧海，横浸三山，则中朝群公岂知遐荒之外有如是山水？山水既尔，人亦其然。衮乎对此，与我分手。"], "励志": ["苟无济代心，独善亦何益。惟君家世者，偃息逢休明。谈天信浩荡，说剑纷纵横。谢公不徒然，起来为苍生。", "一条藤径绿，万点雪峰晴。 地冷叶先尽，谷寒云不行。嫩篁侵舍密，古树倒江横。 白犬离村吠，苍苔壁上生。"], "闲适": ["竹下忘言对紫茶，全胜羽客醉流霞。尘心洗尽兴难尽，一树蝉声片影斜。", "南州溽暑醉如酒，隐几熟眠开北牖。日午独觉无馀声，山童隔竹敲茶臼。", "遥闻境会茶山夜，珠翠歌钟俱绕身。盘下中分两州界，灯前各作一家春。青娥递舞应争妙，紫笋齐尝各斗新。自叹花时北窗下，蒲黄酒对病眠人。", "满塘秋水碧泓澄，十亩菱花晚镜清。景动新桥横螮蝀，岸铺芳草睡。蟾投夜魄当湖落，岳倒秋莲入浪生。何处最添诗客兴，黄昏烟雨乱蛙声。"], "抒怀": ["云台盛多士，待君丹墀侧。。峡口大漠南，横绝界中国。丛石何纷纠，赤山复翕赩。", "南京久客耕南亩，北望伤神坐北窗。昼引老妻乘小艇，晴看稚子浴清江。俱飞蛱蝶元相逐，并蒂芙蓉本自双。茗饮蔗浆携所有，瓷罂无谢玉为缸。", "西垂下斗绝，欲似窥人寰。反如在幽谷，榛翳不可攀。命童恣披翦，葺宇横断山。割如判清浊，飘若升云间。", "啁啾有馀乐，飞舞西陵隈。回风旦夕至，零叶委陈荄。所栖不足恃，鹰隼纵横来。。", "今人咏古书，善恶宜自分。秦火不爇舌，秦火空蓺文。所以詈更生，至今横絪缊。。"], "思乡": ["旅客三秋至，层城四望开。楚山横地出，汉水接天回。冠盖非新里，章华即旧台。习池风景异，归路满尘埃。", "黄鹤楼前月华白，此中忽见峨眉客。峨眉山月还送君，风吹西到长安陌。长安大道横九天，峨眉山月照秦川。黄金狮子乘高座，白玉麈尾谈重玄。", "九日黄花酒，登高会昔闻。霜威逐亚相，杀气傍中军。横笛惊征雁，娇歌落塞云。边头幸无事，醉舞荷吾君。", "天山雪后海风寒，横笛偏吹行路难。碛里征人三十万，一时回首月中看。", "慕隐既有系，图功遂无成。聊从田父言，款曲陈此情。眷然抚耒耜，回首烟云横。。"], "思念": ["此曲有意无人传，愿随春风寄燕然。忆君迢迢隔青天。昔时横波目，今作流泪泉。不信妾肠断，归来看取明镜前。", "赵瑟初停凤凰柱，蜀琴欲奏鸳鸯弦。此曲有意无人传，愿随春风寄燕然，忆君迢迢隔青天。昔日横波目，今成流泪泉。不信妾肠断，归来看取明镜前。", "赵瑟初停凤凰柱，蜀琴欲奏鸳鸯弦。此曲有意无人传，愿随春风寄燕然。忆君迢迢隔青天，昔日横波目，今作流泪泉。不信妾断肠，归来看取明镜前。", "楼上黄昏欲望休，玉梯横绝月中钩。芭蕉不展丁香结，同向春风各自愁。"], "送别": ["江送巴南水，山横塞北云。津亭秋月夜，谁见泣离群？ 乱烟笼碧砌，飞月向南端。寂寞离亭掩，江山此夜寒。", "匈奴犹未灭，魏绛复从戎。怅别三河道，言追六郡雄。雁山横代北，狐塞接云中。勿使燕然上，惟留汉将功。", "宁知班定远，犹是一书生。。忽闻天上将，关塞重横行。始返楼兰国，还向朔方城。", " 逸兴满吴云，飘飖浙江汜。挥手杭越间，樟亭望潮还。 涛卷海门石，云横天际山。白马走素车，雷奔骇心颜。", "五峰转月色，百里行松声。 灵溪咨沿越，华顶殊超忽。石梁横青天，侧足履半月。 忽然思永嘉，不惮海路赊。", "钓台碧云中，邈与苍岭对。 稍稍来吴都，裴回上姑苏。烟绵横九疑，漭荡见五湖。 目极心更远，悲歌但长吁。", "闻道稽山去，偏宜谢客才。千岩泉洒落，万壑树萦回。东海横秦望，西陵绕越台。湖清霜镜晓，涛白雪山来。"], "孤寂": [], "愁苦": ["西垂下斗绝，欲似窥人寰。反如在幽谷，榛翳不可攀。命童恣披翦，葺宇横断山。割如判清浊，飘若升云间。"], "忧国忧民": ["汉江回万里，派作九龙盘。横溃豁中国，崔嵬飞迅湍。六帝沦亡后，三吴不足观。我君混区宇，垂拱众流安。今日任公子，沧浪罢钓竿。", "”“中男绝短小，何以守王城？”肥男有母送，瘦男独伶俜。白水暮东流，青山犹哭声。“莫自使眼枯，收汝泪纵横。眼枯即见骨，天地终无情！我军取相州，日夕望其平。", "海人无家海里住，采珠役象为岁赋。 恶波横天山塞路，未央宫中常满库。", "缯纩无温，堕指裂肤。当此苦寒，天假强胡，凭陵杀气，以相剪屠。径截辎重，横攻士卒。都尉新降，将军复没。"], "咏史怀古": ["。长安大道连狭斜，青牛白马七香车。玉辇纵横过主第，金鞭络绎向侯家。龙衔宝盖承朝日，凤吐流苏带晚霞。", "旅客三秋至，层城四望开。楚山横地出，汉水接天回。冠盖非新里，章华即旧台。习池风景异，归路满尘埃。", "秦鹿奔野草，逐之若飞蓬。项王气盖世，紫电明双瞳。呼吸八千人，横行起江东。赤精斩白帝，叱咤入关中。"], "壮志难酬": [], "讽刺": ["铜柱朱崖道路难，伏波横海旧登坛。越人自贡珊瑚树，汉使何劳獬豸冠。疲马山中愁日晚，孤舟江上畏春寒。由来此货称难得，多恐君王不忍看。", "金炉陈兽炭，谈笑正得意。岂论草泽中，有此枯槁士？我惭经济策，久欲甘弃置。君负纵横才，如何尚憔悴？长歌增郁怏，对酒不能醉。穷达自有时，夫子莫下泪。", "军门频纳受降书，一剑横行万里馀。 汉祖谩夸娄敬策，却将公主嫁单于。 汉家旌帜满阴山，不遣胡儿匹马还。 愿得此身长报国，何须生入玉门关。", "绝胭断骨那下补，万金宠赠不如土。。汉家三十六将军，东方雷动横阵云。鸡鸣函谷客如雾，貌同心异不可数。", "隋堤柳，汴河旁，夹岸绿阴千里。龙舟凤舸木兰香，锦帆张。因梦江南春景好，一路流苏羽葆。笙歌未尽起横流，锁春愁。"]}, "莲": {"爱情": ["垂钓绿湾春，春深杏花乱。潭清疑水浅，荷动知鱼散。日暮待情人，维舟绿杨岸。", "。西施越溪女，出自苎萝山。秀色掩今古，荷花羞玉颜。浣纱弄碧水，自与清波闲。", "菡萏香连十顷陂，小姑贪戏采莲迟。 晚来弄水船头湿，更脱红裙裹鸭儿。 船动湖光滟滟秋，贪看年少信船流。 无端隔水抛莲子，遥被人知半日羞。", "妾家住横塘，红纱满桂香。青云教绾头上髻，明月与作耳边珰。莲风起，江畔春；大堤上，留北人。郎食鲤鱼尾，妾食猩猩唇。", "春寒赐浴华清池，温泉水滑洗凝脂。侍儿扶起娇无力，始是新承恩泽时。云鬓花颜金步摇，芙蓉帐暖度春宵。春宵苦短日高起，从此君王不早朝。", "马嵬坡下泥土中，不见玉颜空死处。君臣相顾尽沾衣，东望都门信马归。归来池苑皆依旧，太液芙蓉未央柳。芙蓉如面柳如眉，对此如何不泪垂。", "君臣相顾尽沾衣，东望都门信马归。归来池苑皆依旧，太液芙蓉未央柳。芙蓉如面柳如眉，对此如何不泪垂。春风桃李花开日，秋雨梧桐叶落时。"], "赞美": ["义公习禅寂，结宇依空林。户外一峰秀，阶前众壑深。夕阳连雨足，空翠落庭阴。看取莲花净，应知不染心。", "裴生信英迈，屈起多才华。历抵海岱豪，结交鲁朱家。复携两少妾，艳色惊荷葩。双歌入青云，但惜白日斜。", "世人学舞只是舞，恣态岂能得如此。。美人舞如莲花旋，世人有眼应未见。高堂满地红氍毹，试舞一曲天下无。", "忽作出塞入塞声，白草胡沙寒飒飒。翻身入破如有神，前见后见回回新。始知诸曲不可比，采莲落梅徒聒耳。世人学舞只是舞，恣态岂能得如此。", "世间花叶不相伦，花入金盆叶作尘。惟有绿荷红菡萏，卷舒开合任天真。此花此叶常相映，翠减红衰愁杀人。"], "友情": ["山光忽西落，池月渐东上。散发乘夕凉，开轩卧闲敞。荷风送香气，竹露滴清响。欲取鸣琴弹，恨无知音赏。感此怀故人，中宵劳梦想。", "何时更杯酒，再得论心胸。。魏都接燕赵，美女夸芙蓉。淇水流碧玉，舟车日奔冲。"], "励志": [], "闲适": ["日日采莲去，洲长多暮归。弄篙莫溅水，畏湿红莲衣。", "山僧对棋坐，局上竹阴清。映竹无人见，时闻下子声。 小娃撑小艇，偷采白莲回。不解藏踪迹，浮萍一道开。", "满塘秋水碧泓澄，十亩菱花晚镜清。景动新桥横螮蝀，岸铺芳草睡。蟾投夜魄当湖落，岳倒秋莲入浪生。何处最添诗客兴，黄昏烟雨乱蛙声。"], "抒怀": ["大唐造昌运，品物荷时成。乘秋逢令节，锡宴观群情。俯临秦山川，高会汉公卿。未追赤松子，且泛黄菊英。赓歌圣人作，海内同休明。", "四邻何所有，一二老寡妻。宿鸟恋本枝，安辞且穷栖。方春独荷锄，日暮还灌畦。县吏知我至，召令习鼓鞞。", "西忆岐阳信，无人遂却回。眼穿当落日，心死著寒灰。雾树行相引，莲峰望忽开。所亲惊老瘦，辛苦贼中来。", "南京久客耕南亩，北望伤神坐北窗。昼引老妻乘小艇，晴看稚子浴清江。俱飞蛱蝶元相逐，并蒂芙蓉本自双。茗饮蔗浆携所有，瓷罂无谢玉为缸。", "郡城南下接通津，异服殊音不可亲。青箬裹盐归峒客，绿荷包饭趁虚人。鹅毛御腊缝山罽，鸡骨占年拜水神。愁向公庭问重译，欲投章甫作文身。"], "思乡": ["山窗游玉女，涧户对琼峰。岩顶翔双凤，潭心倒九龙。酒中浮竹叶，杯上写芙蓉。故验家山赏，惟有风入松。", "九日黄花酒，登高会昔闻。霜威逐亚相，杀气傍中军。横笛惊征雁，娇歌落塞云。边头幸无事，醉舞荷吾君。", "江上数株桑枣树，自从离乱更荒凉。那堪旅馆经残腊，只把空书寄故乡。典尽客衣三尺雪，炼精诗句一头霜。故人多在芙蓉幕，应笑孜孜道未光。"], "思念": ["芳节或蹉跎，游心稍牢落。春华信为美，夏景亦未恶。飐浪嫩青荷，重栏晚红药。吴宫好风月，越郡多楼阁。", "荷叶生时春恨生，荷叶枯时秋恨成。 深知身在情长在，怅望江头江水声。", "来是空言去绝踪，月斜楼上五更钟。梦为远别啼难唤，书被催成墨未浓。蜡照半笼金翡翠，麝熏微度绣芙蓉。刘郎已恨蓬山远，更隔蓬山一万重！"], "送别": ["苍苍竹林寺，杳杳钟声晚。荷笠带斜阳，青山独归远。", "当昔襄阳雄盛时，山公常醉习家池。池边钓女日相随，妆成照影竟来窥。澄波澹澹芙蓉发，绿岸参参杨柳垂。一朝物变人亦非，四面荒凉人住稀。", "巨灵咆哮擘两山，洪波喷箭射东海。三峰却立如欲摧，翠崖丹谷高掌开。白帝金精运元气，石作莲花云作台。云台阁道连窈冥，中有不死丹丘生。", "他日还相访，乘桥蹑彩虹。。黄山四千仞，三十二莲峰。丹崖夹石柱，菡萏金芙蓉。", "。黄山四千仞，三十二莲峰。丹崖夹石柱，菡萏金芙蓉。伊昔升绝顶，下窥天目松。", "鸳鸯帐里暖芙蓉，低泣关山几万重。明镜半边钗一股，此生何处不相逢。"], "孤寂": ["有美不自蔽，安能守孤根。盈盈湘西岸，秋至风霜繁。丽影别寒水，浓芳委前轩。芰荷谅难杂，反此生高原。"], "愁苦": ["有美不自蔽，安能守孤根。盈盈湘西岸，秋至风霜繁。丽影别寒水，浓芳委前轩。芰荷谅难杂，反此生高原。"], "忧国忧民": ["虚明见纤毫，羽虫亦飞扬。物情无巨细，自适固其常。念彼荷戈士，穷年守边疆。何由一洗濯，执热互相望。", "一卧沧江惊岁晚，几回青琐点朝班。瞿塘峡口曲江头，万里风烟接素秋。花萼夹城通御气，芙蓉小苑入边愁。珠帘绣柱围黄鹄，锦缆牙樯起白鸥。", "昆明池水汉时功，武帝旌旗在眼中。织女机丝虚夜月，石鲸鳞甲动秋风。波漂菰米沉云黑，露冷莲房坠粉红。关塞极天惟鸟道，江湖满地一渔翁。"], "咏史怀古": ["隐隐朱城临玉道，遥遥翠幰没金堤。挟弹飞鹰杜陵北，探丸借客渭桥西。俱邀侠客芙蓉剑，共宿娼家桃李蹊。娼家日暮紫罗裙，清歌一啭口氛氲。", "。西施越溪女，出自苎萝山。秀色掩今古，荷花羞玉颜。浣纱弄碧水，自与清波闲。"], "壮志难酬": ["石门长老身如梦，旃檀成林手所种。坐来念念非昔人，万遍莲花为谁用？如今七十自忘机，贪爱都忘筋力微。莫向东轩春野望，花开日出雉皆飞。", "露如微霰下前池，月过回塘万竹悲。浮世本来多聚散，红蕖何事亦离披？悠扬归梦惟灯见，濩落生涯独酒知。岂到白头长知尔，嵩阳松雪有心期。"], "讽刺": ["风动荷花水殿香，姑苏台上宴吴王。西施醉舞娇无力，笑倚东窗白玉床。", "缅怀当途者，济济居声位。邈然在云霄，宁肯更沦踬？周旋多燕乐，门馆列车骑。美人芙蓉姿，狭室兰麝气。金炉陈兽炭，谈笑正得意。", "朝牧牛，牧牛下江曲。夜牧牛，牧牛度村谷。荷蓑出林春雨细，芦管卧吹莎草绿。乱插蓬蒿箭满腰，不怕猛虎欺黄犊。", "秦淮有水水无情，还向金陵漾春色。杨家二世安九重，不御华芝嫌六龙。百幅锦帆风力满，连天展尽金芙蓉。珠翠丁星复明灭，龙头劈浪哀笳发。", "燕啄皇孙，知汉祚之将尽；龙漦帝后，识夏庭之遽衰。 　　敬业皇唐旧臣，公侯冢子。奉先帝之成业，荷本朝之厚恩。宋微子之兴悲，良有以也；袁君山之流涕，岂徒然哉！是用气愤风云，志安社稷。"]}, "飞蓬": {"爱情": ["玉容寂寞泪阑干，梨花一枝春带雨。含情凝睇谢君王，一别音容两渺茫。昭阳殿里恩爱绝，蓬莱宫中日月长。回头下望人寰处，不见长安见尘雾。", "昨夜星辰昨夜风，画楼西畔桂堂东。身无彩凤双飞翼，心有灵犀一点通。隔座送钩春酒暖，分曹射覆蜡灯红。嗟余听鼓应官去，走马兰台类转蓬。 闻道阊门萼绿华，昔年相望抵天涯。岂知一夜秦楼客，偷看吴王苑内花。", "梦为远别啼难唤，书被催成墨未浓。蜡照半笼金翡翠，麝熏微度绣芙蓉。刘郎已恨蓬山远，更隔蓬山一万重。 飒飒东风细雨来，芙蓉塘外有轻雷。", "相见时难别亦难，东风无力百花残。春蚕到死丝方尽，蜡炬成灰泪始干。晓镜但愁云鬓改，夜吟应觉月光寒。蓬山此去无多路，青鸟殷勤为探看。", "来是空言去绝踪，月斜楼上五更钟。梦为远别啼难唤，书被催成墨未浓。蜡照半笼金翡翠，麝熏微度绣芙蓉。刘郎已恨蓬山远，更隔蓬山一万重！"], "赞美": ["单车欲问边，属国过居延。征蓬出汉塞，归雁入胡天。大漠孤烟直，长河落日圆。萧关逢候骑，都护在燕然。", "西蜀樱桃也自红，野人相赠满筠笼。数回细写愁仍破，万颗匀圆讶许同。忆昨赐沾门下省，退朝擎出大明宫。金盘玉箸无消息，此日尝新任转蓬。"], "友情": ["当朝揖高义，举世称英雄。小节岂足言，退耕舂陵东。归来无产业，生事如转蓬。一朝乌裘敝，百镒黄金空。", "醉别复几日，登临遍池台。何时石门路，重有金樽开。秋波落泗水，海色明徂徕。飞蓬各自远，且尽手中杯。", "青山横北郭，白水绕东城。此地一为别，孤蓬万里征。浮云游子意，落日故人情。挥手自兹去，萧萧班马鸣。", "天台邻四明，华顶高百越。门标赤城霞，楼栖沧岛月。凭高登远览，直下见溟渤。云垂大鹏翻，波动巨鳌没。风潮争汹涌，神怪何翕忽。观奇迹无倪，好道心不歇。攀条摘朱实，服药炼金骨。安得生羽毛，千春卧蓬阙？", "日本晁卿辞帝都，征帆一片绕蓬壶。 明月不归沉碧海，白云愁色满苍梧。"], "励志": ["秘书何寂寂，无乃羁豪英。且复归碧山，安能恋金阙。旧宅樵渔地，蓬蒿已应没。却顾女几峰，胡颜见云月。", "自小刺头深草里，而今渐觉出蓬蒿。 时人不识凌云木，直待凌云始道高。"], "闲适": [], "抒怀": ["弃我去者，昨日之日不可留；乱我心者，今日之日多烦忧。长风万里送秋雁，对此可以酣高楼。蓬莱文章建安骨，中间小谢又清发。俱怀逸兴壮思飞，欲上青天览明月。", "弱植不盈尺，远意驻蓬赢。月寒空阶曙，幽梦彩云生。粪壤擢珠树，莓苔插琼英。芳根閟颜色，徂岁为谁荣。", "黄河倒上天，众水有却来。人心不及水，一直去不回。一直亦有巧，不肯至蓬莱。一直不知疲，唯闻至省台。", "王孙莫把比蓬蒿，九日枝枝近鬓毛。露湿秋香满池岸，由来不羡瓦松高。", "誓期春之阳，一振摩霄翰。。栖乌喜林曙，惊蓬伤岁阑。关河三尺雪，何处是天山。"], "思乡": ["百龄何荡漾，万化相推迁。 空谒苍梧帝，徒寻溟海仙。已闻蓬海浅，岂见三桃圆。 倚剑增浩叹，扪襟还自怜。", "满月飞明镜，归心折大刀。转蓬行地远，攀桂仰天高。水路疑霜雪，林栖见羽毛。此时瞻白兔，直欲数秋毫。 稍下巫山峡，犹衔白帝城。气沈全浦暗，轮仄半楼明。刁斗皆催晓，蟾蜍且自倾。张弓倚残魄，不独汉家营。", "薄躯信无庸，锁屑剧斗筲。囚居固其宜，厚羞久已包。庭除植蓬艾，隟牖悬蟏蛸。所赖山水客，扁舟柱长梢。", " 时难年荒世业空，弟兄羁旅各西东。田园寥落干戈后，骨肉流离道路中。吊影分为千里雁，辞根散作九秋蓬。共看明月应垂泪，一夜乡心五处同。"], "思念": ["白露披梧桐，玄蝉昼夜号。秋风万里动，日暮黄云高。 君子佐休明，小人事蓬蒿。所适在鱼鸟，焉能徇锥刀。 孤舟向广武，一鸟归成皋。胜概日相与，思君心郁陶。", "相见时难别亦难，东风无力百花残。春蚕到死丝方尽，蜡炬成灰泪始干。晓镜但愁云鬓改，夜吟应觉月光寒。蓬山此去无多路，青鸟殷勤为探看。", "来是空言去绝踪，月斜楼上五更钟。梦为远别啼难唤，书被催成墨未浓。蜡照半笼金翡翠，麝熏微度绣芙蓉。刘郎已恨蓬山远，更隔蓬山一万重！"], "送别": ["明星玉女备洒扫，麻姑搔背指爪轻。我皇手把天地户，丹丘谈天与天语。九重出入生光辉，东来蓬莱复西归。玉浆倘惠故人饮，骑二茅龙上天飞。", "醉别复几日，登临遍池台。何时石门路，重有金樽开。秋波落泗水，海色明徂徕。飞蓬各自远，且尽手中杯。", "青山横北郭，白水绕东城。此地一为别，孤蓬万里征。浮云游子意，落日故人情。挥手自兹去，萧萧班马鸣。", "行子对飞蓬，金鞭指铁骢。功名万里外，心事一杯中。 虏障燕支北，秦城太白东。离魂莫惆怅，看取宝刀雄。", "诗卷长留天地间，钓竿欲拂珊瑚树。深山大泽龙蛇远，春寒野阴风景暮。蓬莱织女回云车，指点虚无是归路。自是君身有仙骨，世人那得知其故。"], "孤寂": [], "愁苦": [], "忧国忧民": ["逢君穆陵路，匹马向桑乾。楚国苍山古，幽州白日寒。城池百战后，耆旧几家残。处处蓬蒿遍，归人掩泪看。", "杜子将北征，苍茫问家室。维时遭艰虞，朝野少暇日。顾惭恩私被，诏许归蓬荜。拜辞诣阙下，怵惕久未出。", "直北关山金鼓振，征西车马羽书驰。鱼龙寂寞秋江冷，故国平居有所思。蓬莱宫阙对南山，承露金茎霄汉间。西望瑶池降王母，东来紫气满函关。", "应过数粒食，得近四知金。春草封归恨，源花费独寻。转蓬忧悄悄，行药病涔涔。瘗夭追潘岳，持危觅邓林。", "夫因兵死守蓬茅，麻苎衣衫鬓发焦。桑柘废来犹纳税，田园荒后尚征苗。时挑野菜和根煮，旋斫生柴带叶烧。任是深山更深处，也应无计避征徭。"], "咏史怀古": ["君不见，高阳酒徒起草中，长揖山东隆准公。入门不拜逞雄辩，两女辍洗来趋风。东下齐城七十二，指挥楚汉如旋蓬。狂客落魄尚如此，何况壮士当群雄！我欲攀龙见明主，雷公砰訇震天鼓。", "抚掌黄河曲，嗤嗤阮嗣宗。。秦鹿奔野草，逐之若飞蓬。项王气盖世，紫电明双瞳。", "碧溪留我武关东，一笑怀王迹自穷。郑袖娇娆酣似醉，屈原憔悴去如蓬。山樯谷堑依然在，弱吐强吞尽已空。今日圣神家四海，戍旗长卷夕阳中。"], "壮志难酬": [], "讽刺": ["悲风四边来，肠断白杨声。借问谁家地，埋没蒿里茔。古老向余言，言是上留田，蓬科马鬣今已平。 昔之弟死兄不葬，他人于此举铭旌。", "心应弦，手应鼓。弦鼓一声双袖举。回雪飘飖转蓬舞。左旋右转不知疲，千匝万周无已时。", "朝牧牛，牧牛下江曲。夜牧牛，牧牛度村谷。荷蓑出林春雨细，芦管卧吹莎草绿。乱插蓬蒿箭满腰，不怕猛虎欺黄犊。", "渤澥声中涨小堤，官家知后海鸥知。蓬莱有路教人到，应亦年年税紫芝。"]}, "梁": {"爱情": ["双燕复双燕，双飞令人羡。玉楼珠阁不独栖，金窗绣户长相见。柏梁失火去，因入吴王宫。吴宫又焚荡，雏尽巢亦空。", "东家老女嫁不售，白日当天三月半。溧阳公主年十四，清明暖后同墙看。归来展转到五更，梁间燕子闻长叹。。", "幸会东城宴未回，年华忧共水相催。梁家宅里秦宫入，赵后楼中赤凤来。冰簟且眠金镂枕，琼筵不醉玉交杯。宓妃愁坐芝田馆，用尽陈王八斗才。", "忆泥燕，飞到画堂前。占得杏梁安稳处，体轻唯有主人怜，堪羡好因缘。", "忆泥燕，飞到画堂前。占得杏梁安稳处，体轻唯有主人怜，堪羡好因缘。"], "赞美": ["平生怀感激，本欲候知己。去矣难重陈，飘然自兹始。游梁且未遇，适越今何以。乡山西北愁，竹箭东南美。", "至都，太尉怒曰：“果不用吾言！”晤谢曰：“处贱无以拒也。”太尉曰：“然终不以在吾第。”以如司农治事堂，栖之梁木上。泚反，太尉终，吏以告泚，泚取视，其故封识具存。"], "友情": ["贵贱结交心不移，唯有严陵及光武。周公称大圣，管蔡宁相容。汉谣一斗粟，不与淮南舂。兄弟尚路人，吾心安所从。", "黄鸟翩翩杨柳垂，春风送客使人悲。怨别自惊千里外，论交却忆十年时。云开汶水孤帆远，路绕梁山匹马迟。此地从来可乘兴，留君不住益凄其。", "未负幽栖志，兼全宠辱身。剧谈怜野逸，嗜酒见天真。醉舞梁园夜，行歌泗水春。才高心不展，道屈善无邻。", "几年遭鵩鸟，独泣向麒麟。苏武先还汉，黄公岂事秦。楚筵辞醴日，梁狱上书辰。已用当时法，谁将此义陈。", "花时同醉破春愁，醉折花枝作酒筹。忽忆故人天际去，计程今日到梁州。", "嵩云秦树久离居，双鲤迢迢一纸书。 休问梁园旧宾客，茂陵秋雨病相如。"], "励志": ["怀帝阍而不见，奉宣室以何年？　　嗟乎！时运不齐，命途多舛。冯唐易老，李广难封。屈贾谊于长沙，非无圣主；窜梁鸿于海曲，岂乏明时？所赖君子见机，达人知命。老当益壮，宁移白首之心？穷且益坚，不坠青云之志。"], "闲适": [], "抒怀": ["东方公足下：文章道弊五百年矣。汉魏风骨，晋宋莫传，然而文献有可征者。仆尝暇时观齐、梁间诗，彩丽竞繁，而兴寄都绝，每以永叹。思古人，常恐逶迤颓靡，风雅不作，以耿耿也。", "。蟠木不雕饰，且将斤斧疏。樽成山岳势，材是栋梁馀。 外与金罍并，中涵玉醴虚。", "国风冲融迈三五，朝廷欢乐弥寰宇。白璧皆言赐近臣，布衣不得干明主。归来洛阳无负郭，东过梁宋非吾土。兔苑为农岁不登，雁池垂钓心长苦。", "长卿怀茂陵，绿草垂石井。弹琴看文君，春风吹鬓影。梁王与武帝，弃之如断梗。惟留一简书，金泥泰山顶。", "忆泥燕，飞到画堂前。占得杏梁安稳处，体轻唯有主人怜，堪羡好因缘。"], "思乡": ["。自河南经乱，关内阻饥，兄弟离散，各在一处。因望月有感，聊书所怀，寄上浮梁大兄、於潜七兄、乌江十五兄，兼示符离及下邽弟妹。 时难年荒世业空，弟兄羁旅各西东。"], "思念": ["卢家少妇郁金堂，海燕双栖玳瑁梁。九月寒砧催木叶，十年征戍忆辽阳。白狼河北音书断，丹凤城南秋夜长。谁谓含愁独不见，更教明月照流黄。", "花时同醉破春愁，醉折花枝作酒筹。忽忆故人天际去，计程今日到梁州。", "嵩云秦树久离居，双鲤迢迢一纸书。 休问梁园旧宾客，茂陵秋雨病相如。"], "送别": ["五峰转月色，百里行松声。 灵溪咨沿越，华顶殊超忽。石梁横青天，侧足履半月。 忽然思永嘉，不惮海路赊。", "平生怀感激，本欲候知己。去矣难重陈，飘然自兹始。游梁且未遇，适越今何以。乡山西北愁，竹箭东南美。", "黄鸟翩翩杨柳垂，春风送客使人悲。怨别自惊千里外，论交却忆十年时。云开汶水孤帆远，路绕梁山匹马迟。此地从来可乘兴，留君不住益凄其。"], "孤寂": ["春夜阑，春恨切，花外子规啼月。人不见，梦难凭，红纱一点灯。偏怨别，是芳节，庭下丁香千结。宵雾散，晓霞晖，梁间双燕飞。"], "愁苦": ["长卿怀茂陵，绿草垂石井。弹琴看文君，春风吹鬓影。梁王与武帝，弃之如断梗。惟留一简书，金泥泰山顶。"], "忧国忧民": ["萧曹曾作沛中吏，攀龙附凤当有时。溧阳酒楼三月春，杨花漠漠愁杀人。胡人绿眼吹玉笛，吴歌白纻飞梁尘。丈夫相见且为乐，槌牛挝鼓会众宾。", "群冰从西下，极目高崒兀。疑是崆峒来，恐触天柱折。河梁幸未坼，枝撑声窸窣。行旅相攀援，川广不可越。", "花近高楼伤客心，万方多难此登临。锦江春色来天地，玉垒浮云变古今。北极朝廷终不改，西山寇盗莫相侵。可怜后主还祠庙，日暮聊为《梁甫吟》。", "九月降霜秋早寒，禾穗未熟皆青乾。长吏明知不申破，急敛暴征求考课。典桑卖地纳官租，明年衣食将何如？剥我身上帛，夺我口中粟。虐人害物即豺狼，何必钩爪锯牙食人肉？不知何人奏皇帝，帝心恻隐知人弊。", "春种一粒粟，秋收万颗子。四海无闲田，农夫犹饿死。 锄禾日当午，汗滴禾下土。谁知盘中餐，粒粒皆辛苦？"], "咏史怀古": ["游蜂戏蝶千门侧，碧树银台万种色。复道交窗作合欢，双阙连甍垂凤翼。梁家画阁中天起，汉帝金茎云外直。楼前相望不相知，陌上相逢讵相识。", "比目鸳鸯真可羡，双去双来君不见。生憎帐额绣孤鸾，好取门帘帖双燕。双燕双飞绕画梁，罗帷翠被郁金香。片片行云着蝉鬓，纤纤初月上鸦黄。", "风云感会起屠钓，大人臲屼当安之。。长啸梁甫吟，何时见阳春？君不见，朝歌屠叟辞棘津，八十西来钓渭滨。宁羞白发照清水，逢时壮气思经纶。", "力排南山三壮士，齐相杀之费二桃。吴楚弄兵无剧孟，亚夫咍尔为徒劳。梁甫吟，声正悲。张公两龙剑，神物合有时。", "猿鸟犹疑畏简书，风云常为护储胥。徒令上将挥神笔，终见降王走传车。管乐有才原不忝，关张无命欲何如？他年锦里经祠庙，梁父吟成恨有余。", "怀帝阍而不见，奉宣室以何年？　　嗟乎！时运不齐，命途多舛。冯唐易老，李广难封。屈贾谊于长沙，非无圣主；窜梁鸿于海曲，岂乏明时？所赖君子见机，达人知命。老当益壮，宁移白首之心？穷且益坚，不坠青云之志。"], "壮志难酬": [], "讽刺": ["因天下之失望，顺宇内之推心，爰举义旗，以清妖孽。南连百越，北尽三河，铁骑成群，玉轴相接。海陵红粟，仓储之积靡穷；江浦黄旗，匡复之功何远？班声动而北风起，剑气冲而南斗平。喑呜则山岳崩颓，叱吒则风云变色。"]}, "泽兰": {"爱情": ["北客真王公，朱衣满江中。日暮来投宿，数朝不肯东。好乘浮云骢，佳期兰渚东。鸳鸯绿浦上，翡翠锦屏中。", "江上朱楼新雨晴，瀼西春水縠文生。桥东桥西好杨柳，人来人去唱歌行。日出三竿春雾消，江头蜀客驻兰桡。凭寄狂夫书一纸，信在成都万里桥。", "身无彩凤双飞翼，心有灵犀一点通。隔座送钩春酒暖，分曹射覆蜡灯红。嗟余听鼓应官去，走马兰台类转蓬。 闻道阊门萼绿华，昔年相望抵天涯。", "。藕丝作线难胜针，蕊粉染黄那得深。玉白兰芳不相顾，青楼一笑轻千金。莫言自古皆如此，健剑刜钟铅绕指。", "昨夜星辰昨夜风，画楼西畔桂堂东。身无彩凤双飞翼，心有灵犀一点通。隔座送钩春酒暖，分曹射覆蜡灯红。嗟余听鼓应官去，走马兰台类转蓬。"], "赞美": ["。忽闻天上将，关塞重横行。始返楼兰国，还向朔方城。黄金装战马，白羽集神兵。", "兰陵美酒郁金香，玉碗盛来琥珀光。 但使主人能醉客，不知何处是他乡。", "依依宜织江雨空，雨中六月兰台风。博罗老仙时出洞，千岁石床啼鬼工。蛇毒浓凝洞堂湿，江鱼不食衔沙立。欲剪箱中一尺天，吴娥莫道吴刀涩。", "春风何处好？别殿饶芳草。苒嫋转鸾旗，萎蕤吹雉葆。扬芳历九门，澹荡入兰荪。争奈白团扇，时时偷主恩。"], "友情": ["他日青云去，黄金报主人。。兰生不当户，别是闲庭草。夙被霜露欺，红荣已先老。", "此心曾与木兰舟，直到天南潮水头。隔岭篇章来华岳，出关书信过泷流。峰悬驿路残云断，海浸城根老树秋。一夕瘴烟风卷尽，月明初上浪西楼。"], "励志": ["临帝子之长洲，得仙人之旧馆。层峦耸翠，上出重霄；飞阁流丹，下临无地。鹤汀凫渚，穷岛屿之萦回；桂殿兰宫，即冈峦之体势。　　披绣闼，俯雕甍，山原旷其盈视，川泽纡其骇瞩。", "非谢家之宝树，接孟氏之芳邻。他日趋庭，叨陪鲤对；今兹捧袂，喜托龙门。杨意不逢，抚凌云而自惜；钟期既遇，奏流水以何惭？　　呜乎！胜地不常，盛筵难再；兰亭已矣，梓泽丘墟。临别赠言，幸承恩于伟饯；登高作赋，是所望于群公。"], "闲适": [], "抒怀": [" 随波混清浊，与物同丑丽。眇忆青岩栖，宁忘褐衣拜。 自言爱水石，本欲亲兰蕙。何意薄松筠，翻然重菅蒯。", "。秋风吹地百草干，华容碧影生晚寒。我当二十不得意，一心愁谢如枯兰。衣如飞鹑马如狗，临歧击剑生铜吼。", "登明选公，杂进巧拙，纡馀为妍，卓荦为杰，校短量长，惟器是适者，宰相之方也。昔者孟轲好辩，孔道以明，辙环天下，卒老于行。荀卿守正，大论是弘，逃谗于楚，废死兰陵。是二儒者，吐辞为经，举足为法，绝类离伦，优入圣域，其遇于世何如也？今先生学虽勤而不繇其统，言虽多而不要其中，文虽奇而不济于用，行虽修而不显于众。"], "思乡": ["去年上巳洛桥边，今年寒食庐山曲。遥怜巩树花应满，复见吴洲草新绿。吴洲春草兰杜芳，感物思归怀故乡。驿骑明朝发何处？猿声今夜断君肠。", "灶火通军壁，烽烟上戍楼。龙庭但苦战，燕颔会封侯。莫作兰山下，空令汉国羞。。", "为忆长安烂熳开，我今移尔满庭栽。 红兰莫笑青青色，曾向龙山泛酒来。"], "思念": ["北客真王公，朱衣满江中。日暮来投宿，数朝不肯东。好乘浮云骢，佳期兰渚东。鸳鸯绿浦上，翡翠锦屏中。", "表请回军掩尘骨，莫教兵士哭龙荒。青海长云暗雪山，孤城遥望玉门关。黄沙百战穿金甲，不破楼兰终不还。大漠风尘日色昏，红旗半卷出辕门。", "前军夜战洮河北，已报生擒吐谷浑。胡瓶落膊紫薄汗，碎叶城西秋月团。明敕星驰封宝剑，辞君一夜取楼兰。玉门山嶂几千重，山北山南总是烽。", "燕草如碧丝，秦桑低绿枝。当君怀归日，是妾断肠时。 春风不相识，何事入罗帏。", "闽国扬帆去，蟾蜍亏复圆。秋风生渭水，落叶满长安。此地聚会夕，当时雷雨寒。兰桡殊未返，消息海云端。", "薄罗衫子金泥凤，困纤腰怯铢衣重。笑迎移步小兰丛，亸金翘玉凤。娇多情脉脉，羞把同心捻弄。楚天云雨却相和，又入阳台梦。"], "送别": ["。忽闻天上将，关塞重横行。始返楼兰国，还向朔方城。黄金装战马，白羽集神兵。", "胡姬招素手，延客醉金樽。临当上马时，我独与君言。风吹芳兰折，日没鸟雀喧。举手指飞鸿，此情难具论。", " 随波混清浊，与物同丑丽。眇忆青岩栖，宁忘褐衣拜。 自言爱水石，本欲亲兰蕙。何意薄松筠，翻然重菅蒯。", "闽国扬帆去，蟾蜍亏复圆。秋风生渭水，落叶满长安。此地聚会夕，当时雷雨寒。兰桡殊未返，消息海云端。"], "孤寂": [], "愁苦": [], "忧国忧民": ["咽咽学楚吟，病骨伤幽素。秋姿白发生，木叶啼风雨。 灯青兰膏歇，落照飞蛾舞。古壁生凝尘，羁魂梦中语。"], "咏史怀古": ["临帝子之长洲，得仙人之旧馆。层峦耸翠，上出重霄；飞阁流丹，下临无地。鹤汀凫渚，穷岛屿之萦回；桂殿兰宫，即冈峦之体势。　　披绣闼，俯雕甍，山原旷其盈视，川泽纡其骇瞩。", "非谢家之宝树，接孟氏之芳邻。他日趋庭，叨陪鲤对；今兹捧袂，喜托龙门。杨意不逢，抚凌云而自惜；钟期既遇，奏流水以何惭？　　呜乎！胜地不常，盛筵难再；兰亭已矣，梓泽丘墟。临别赠言，幸承恩于伟饯；登高作赋，是所望于群公。"], "壮志难酬": [], "讽刺": ["缅怀当途者，济济居声位。邈然在云霄，宁肯更沦踬？周旋多燕乐，门馆列车骑。美人芙蓉姿，狭室兰麝气。金炉陈兽炭，谈笑正得意。", "隋堤柳，汴河旁，夹岸绿阴千里。龙舟凤舸木兰香，锦帆张。因梦江南春景好，一路流苏羽葆。笙歌未尽起横流，锁春愁。"]}, "木樨": {"爱情": ["今日菖蒲花，明朝枫树老。。妾家住横塘，红纱满桂香。青云教绾头上髻，明月与作耳边珰。", "岂知一夜秦楼客，偷看吴王苑内花。。昨夜星辰昨夜风，画楼西畔桂堂东。身无彩凤双飞翼，心有灵犀一点通。", "重帏深下莫愁堂，卧后清宵细细长。神女生涯原是梦，小姑居处本无郎。风波不信菱枝弱，月露谁教桂叶香。直道相思了无益，未妨惆怅是清狂。", "昨夜星辰昨夜风，画楼西畔桂堂东。身无彩凤双飞翼，心有灵犀一点通。隔座送钩春酒暖，分曹射覆蜡灯红。嗟余听鼓应官去，走马兰台类转蓬。"], "赞美": ["世人种桃李，皆在金张门。攀折争捷径，及此春风暄。一朝天霜下，荣耀难久存。安知南山桂，绿叶垂芳根。清阴亦可托，何惜树君园。", "还山吟，天高日暮寒山深，送君还山识君心。人生老大须恣意，看君解作一生事。山间偃仰无不至，石泉淙淙若风雨，桂花松子常满地。卖药囊中应有钱，还山服药又长年。"], "友情": ["江淮度寒食，京洛缝春衣。置酒长安道，同心与我违。行当浮桂棹，未几拂荆扉。远树带行客，孤城当落晖。", "海内贤豪青云客，就中与君心莫逆。回山转海不作难，倾情倒意无所惜。我向淮南攀桂枝，君留洛北愁梦思。不忍别，还相随。", "去国十年同赴召，渡湘千里又分歧。重临事异黄丞相，三黜名惭柳士师。归目并随回雁尽，愁肠正遇断猿时。桂江东过连山下，相望长吟有所思。", "忘我尚可，岂得忘此山水哉！。　　大丈夫其谁不有四方志？则仆与宗衮二年之间，会而离，离而会，经途所亘，凡三万里。何以言之？去年春会于京师，是时仆如桂林，衮如滑台；今年秋，乃不期而会于桂林；居无何，又归滑台，王事故也。舟车往返，岂止三万里乎？人生几何？而倏聚忽散，辽夐若此，抑知己难遇，亦复何辞！ 　　岁十有一月，二三子出饯于野。", "加以尖山万重，平地卓立。黑是铁色，锐如笔锋。复有阳江、桂江，略军城而南走，喷入沧海，横浸三山，则中朝群公岂知遐荒之外有如是山水？山水既尔，人亦其然。衮乎对此，与我分手。"], "励志": ["临帝子之长洲，得仙人之旧馆。层峦耸翠，上出重霄；飞阁流丹，下临无地。鹤汀凫渚，穷岛屿之萦回；桂殿兰宫，即冈峦之体势。　　披绣闼，俯雕甍，山原旷其盈视，川泽纡其骇瞩。"], "闲适": [], "抒怀": ["越绝孤城千万峰，空斋不语坐高舂。印文生绿经旬合，砚匣留尘尽日封。梅岭寒烟藏翡翠，桂江秋水露鰅鳙。丈人本自忘机事，为想年来憔悴容。", "泛广岂无涘，姿行亦有随。语中失次第，身外生疮痍。桂蠧既潜污，桂花损贞姿。詈言一失香，千古闻臭词。", "洞庭明月一千里，凉风雁啼天在水。九节菖蒲石上死，湘神弹琴迎帝子。山头老桂吹古香，雌龙怨吟寒水光。沙浦走鱼白石郎，闲取真珠掷龙堂。", "滞雨通宵又彻明，百忧如草雨中生。心关桂玉天难晓，运落风波梦亦惊。压树早鸦飞不散，到窗寒鼓湿无声。当年志气俱消尽，白发新添四五茎。"], "思乡": ["。满月飞明镜，归心折大刀。转蓬行地远，攀桂仰天高。水路疑霜雪，林栖见羽毛。", "中庭地白树栖鸦，冷露无声湿桂花。今夜月明人尽望，不知秋思落谁家。"], "思念": ["桂叶双眉久不描，残妆和泪污红绡。长门尽日无梳洗，何必珍珠慰寂寥。", "无家对寒食，有泪如金波。斫却月中桂，清光应更多。仳离放红蕊，想像嚬青蛾。牛女漫愁思，秋期犹渡河。", "桂魄初生秋露微，轻罗已薄未更衣。银筝夜久殷勤弄，心怯空房不忍归。", "重帏深下莫愁堂，卧后清宵细细长。神女生涯原是梦，小姑居处本无郎。风波不信菱枝弱，月露谁教桂叶香。直道相思了无益，未妨惆怅是清狂。"], "送别": ["江淮度寒食，京洛缝春衣。置酒长安道，同心与我违。行当浮桂棹，未几拂荆扉。远树带行客，孤城当落晖。", "楚客醉孤舟，越水将引棹。山为两乡别，月带千里貌。羁谴同缯纶，僻幽闻虎豹。桂林寒色在，苦节知所效。", "归休白鹅岭，渴饮丹砂井。凤吹我时来，云车尔当整。去去陵阳东，行行芳桂丛。回溪十六度，碧嶂尽晴空。", "梦视旌旆何由见，每值清风一回面。洞里先生那怪迟，人天无路自无期。砂泉丹井非同味，桂树榆林不并枝。吾翁致身殊得计，地仙亦是三千岁。", "苍苍森八桂，兹地在湘南。江作青罗带，山如碧玉篸。户多输翠羽，家自种黄甘。远胜登仙去，飞鸾不假骖。"], "孤寂": ["仰幽岩而流盼，抚桂枝以凝想。将千龄兮此遇，荃何为兮独往。", "越绝孤城千万峰，空斋不语坐高舂。印文生绿经旬合，砚匣留尘尽日封。梅岭寒烟藏翡翠，桂江秋水露鰅鳙。丈人本自忘机事，为想年来憔悴容。"], "愁苦": ["越绝孤城千万峰，空斋不语坐高舂。印文生绿经旬合，砚匣留尘尽日封。梅岭寒烟藏翡翠，桂江秋水露鰅鳙。丈人本自忘机事，为想年来憔悴容。"], "忧国忧民": [], "咏史怀古": ["昔时金阶白玉堂，即今惟见青松在。寂寂寥寥扬子居，年年岁岁一床书。独有南山桂花发，飞来飞去袭人裾。。", "临帝子之长洲，得仙人之旧馆。层峦耸翠，上出重霄；飞阁流丹，下临无地。鹤汀凫渚，穷岛屿之萦回；桂殿兰宫，即冈峦之体势。　　披绣闼，俯雕甍，山原旷其盈视，川泽纡其骇瞩。"], "壮志难酬": [], "讽刺": ["洞庭明月一千里，凉风雁啼天在水。九节菖蒲石上死，湘神弹琴迎帝子。山头老桂吹古香，雌龙怨吟寒水光。沙浦走鱼白石郎，闲取真珠掷龙堂。"]}, "肉桂": {"爱情": ["今日菖蒲花，明朝枫树老。。妾家住横塘，红纱满桂香。青云教绾头上髻，明月与作耳边珰。", "岂知一夜秦楼客，偷看吴王苑内花。。昨夜星辰昨夜风，画楼西畔桂堂东。身无彩凤双飞翼，心有灵犀一点通。", "重帏深下莫愁堂，卧后清宵细细长。神女生涯原是梦，小姑居处本无郎。风波不信菱枝弱，月露谁教桂叶香。直道相思了无益，未妨惆怅是清狂。", "昨夜星辰昨夜风，画楼西畔桂堂东。身无彩凤双飞翼，心有灵犀一点通。隔座送钩春酒暖，分曹射覆蜡灯红。嗟余听鼓应官去，走马兰台类转蓬。"], "赞美": ["世人种桃李，皆在金张门。攀折争捷径，及此春风暄。一朝天霜下，荣耀难久存。安知南山桂，绿叶垂芳根。清阴亦可托，何惜树君园。", "还山吟，天高日暮寒山深，送君还山识君心。人生老大须恣意，看君解作一生事。山间偃仰无不至，石泉淙淙若风雨，桂花松子常满地。卖药囊中应有钱，还山服药又长年。"], "友情": ["江淮度寒食，京洛缝春衣。置酒长安道，同心与我违。行当浮桂棹，未几拂荆扉。远树带行客，孤城当落晖。", "海内贤豪青云客，就中与君心莫逆。回山转海不作难，倾情倒意无所惜。我向淮南攀桂枝，君留洛北愁梦思。不忍别，还相随。", "去国十年同赴召，渡湘千里又分歧。重临事异黄丞相，三黜名惭柳士师。归目并随回雁尽，愁肠正遇断猿时。桂江东过连山下，相望长吟有所思。", "忘我尚可，岂得忘此山水哉！。　　大丈夫其谁不有四方志？则仆与宗衮二年之间，会而离，离而会，经途所亘，凡三万里。何以言之？去年春会于京师，是时仆如桂林，衮如滑台；今年秋，乃不期而会于桂林；居无何，又归滑台，王事故也。舟车往返，岂止三万里乎？人生几何？而倏聚忽散，辽夐若此，抑知己难遇，亦复何辞！ 　　岁十有一月，二三子出饯于野。", "加以尖山万重，平地卓立。黑是铁色，锐如笔锋。复有阳江、桂江，略军城而南走，喷入沧海，横浸三山，则中朝群公岂知遐荒之外有如是山水？山水既尔，人亦其然。衮乎对此，与我分手。"], "励志": ["临帝子之长洲，得仙人之旧馆。层峦耸翠，上出重霄；飞阁流丹，下临无地。鹤汀凫渚，穷岛屿之萦回；桂殿兰宫，即冈峦之体势。　　披绣闼，俯雕甍，山原旷其盈视，川泽纡其骇瞩。"], "闲适": [], "抒怀": ["越绝孤城千万峰，空斋不语坐高舂。印文生绿经旬合，砚匣留尘尽日封。梅岭寒烟藏翡翠，桂江秋水露鰅鳙。丈人本自忘机事，为想年来憔悴容。", "泛广岂无涘，姿行亦有随。语中失次第，身外生疮痍。桂蠧既潜污，桂花损贞姿。詈言一失香，千古闻臭词。", "洞庭明月一千里，凉风雁啼天在水。九节菖蒲石上死，湘神弹琴迎帝子。山头老桂吹古香，雌龙怨吟寒水光。沙浦走鱼白石郎，闲取真珠掷龙堂。", "滞雨通宵又彻明，百忧如草雨中生。心关桂玉天难晓，运落风波梦亦惊。压树早鸦飞不散，到窗寒鼓湿无声。当年志气俱消尽，白发新添四五茎。"], "思乡": ["。满月飞明镜，归心折大刀。转蓬行地远，攀桂仰天高。水路疑霜雪，林栖见羽毛。", "中庭地白树栖鸦，冷露无声湿桂花。今夜月明人尽望，不知秋思落谁家。"], "思念": ["桂叶双眉久不描，残妆和泪污红绡。长门尽日无梳洗，何必珍珠慰寂寥。", "无家对寒食，有泪如金波。斫却月中桂，清光应更多。仳离放红蕊，想像嚬青蛾。牛女漫愁思，秋期犹渡河。", "桂魄初生秋露微，轻罗已薄未更衣。银筝夜久殷勤弄，心怯空房不忍归。", "重帏深下莫愁堂，卧后清宵细细长。神女生涯原是梦，小姑居处本无郎。风波不信菱枝弱，月露谁教桂叶香。直道相思了无益，未妨惆怅是清狂。"], "送别": ["江淮度寒食，京洛缝春衣。置酒长安道，同心与我违。行当浮桂棹，未几拂荆扉。远树带行客，孤城当落晖。", "楚客醉孤舟，越水将引棹。山为两乡别，月带千里貌。羁谴同缯纶，僻幽闻虎豹。桂林寒色在，苦节知所效。", "东浮汴河水，访我三千里。 逸兴满吴云，飘飖浙江汜。挥手杭越间，樟亭望潮还。 涛卷海门石，云横天际山。", "归休白鹅岭，渴饮丹砂井。凤吹我时来，云车尔当整。去去陵阳东，行行芳桂丛。回溪十六度，碧嶂尽晴空。", "梦视旌旆何由见，每值清风一回面。洞里先生那怪迟，人天无路自无期。砂泉丹井非同味，桂树榆林不并枝。吾翁致身殊得计，地仙亦是三千岁。"], "孤寂": ["仰幽岩而流盼，抚桂枝以凝想。将千龄兮此遇，荃何为兮独往。", "越绝孤城千万峰，空斋不语坐高舂。印文生绿经旬合，砚匣留尘尽日封。梅岭寒烟藏翡翠，桂江秋水露鰅鳙。丈人本自忘机事，为想年来憔悴容。"], "愁苦": ["越绝孤城千万峰，空斋不语坐高舂。印文生绿经旬合，砚匣留尘尽日封。梅岭寒烟藏翡翠，桂江秋水露鰅鳙。丈人本自忘机事，为想年来憔悴容。"], "忧国忧民": [], "咏史怀古": ["昔时金阶白玉堂，即今惟见青松在。寂寂寥寥扬子居，年年岁岁一床书。独有南山桂花发，飞来飞去袭人裾。。", "临帝子之长洲，得仙人之旧馆。层峦耸翠，上出重霄；飞阁流丹，下临无地。鹤汀凫渚，穷岛屿之萦回；桂殿兰宫，即冈峦之体势。　　披绣闼，俯雕甍，山原旷其盈视，川泽纡其骇瞩。"], "壮志难酬": [], "讽刺": ["洞庭明月一千里，凉风雁啼天在水。九节菖蒲石上死，湘神弹琴迎帝子。山头老桂吹古香，雌龙怨吟寒水光。沙浦走鱼白石郎，闲取真珠掷龙堂。"]}, "桑树": {"爱情": [], "赞美": ["不知谁家子，调笑来相谑。妾本秦罗敷，玉颜艳名都。绿条映素手，采桑向城隅。使君且不顾，况复论秋胡。", "秦地罗敷女，采桑绿水边。素手青条上，红妆白日鲜。蚕饥妾欲去，五马莫留连。"], "友情": ["故人具鸡黍，邀我至田家。绿树村边合，青山郭外斜。开轩面场圃，把酒话桑麻。待到重阳日，还来就菊花。", "筑台像半月，回向高城隅。置酒望白云，商飙起寒梧。秋山入远海，桑柘罗平芜。水色渌且明，令人思镜湖。", "别君莫道不尽欢，悬知乐客遥相待。石门流水遍桃花，我亦曾到秦人家。不知何处得鸡豕，就中仍见繁桑麻。翛然远与世事间，装鸾驾鹤又复远。", "扶桑已在渺茫中，家在扶桑东更东。 此去与师谁共到，一船明月一帆风。"], "励志": ["经事还谙事，阅人如阅川。细思皆幸矣，下此便翛然。莫道桑榆晚，为霞尚满天。。", "老当益壮，宁移白首之心？穷且益坚，不坠青云之志。酌贪泉而觉爽，处涸辙以犹欢。北海虽赊，扶摇可接；东隅已逝，桑榆非晚。孟尝高洁，空余报国之情；阮籍猖狂，岂效穷途之哭！　　勃，三尺微命，一介书生。"], "闲适": [], "抒怀": ["当时版筑辈，岂知傅说情。一朝和殷羹，光气为列星。伊尹生空桑，捐庖佐皇极。桐宫放太甲，摄政无愧色。", "我行倦风湍，辍棹将问津。空传歌瓠子，感慨独愁人。孟夏桑叶肥，秾阴夹长津。蚕农有时节，田野无闲人。", "翻日迥度昆明飞，凌风邪看细柳翥。我今误落千万山，身同伧人不思还。乡禽何事亦来此，令我生心忆桑梓。闭声回翅归务速，西林紫椹行当熟。", "鸦翎羽箭山桑弓，仰天射落衔芦鸿。麻衣黑肥冲北风，带酒日晚歌田中。男儿屈穷心不穷，枯荣不等嗔天公。寒风又变为春柳，条条看即烟濛濛。"], "思乡": ["泛舟大河里，积水穷天涯。天波忽开拆，郡邑千万家。行复见城市，宛然有桑麻。回瞻旧乡国，渺漫连云霞。", "江上数株桑枣树，自从离乱更荒凉。那堪旅馆经残腊，只把空书寄故乡。典尽客衣三尺雪，炼精诗句一头霜。故人多在芙蓉幕，应笑孜孜道未光。", "翻日迥度昆明飞，凌风邪看细柳翥。我今误落千万山，身同伧人不思还。乡禽何事亦来此，令我生心忆桑梓。闭声回翅归务速，西林紫椹行当熟。", "客舍并州已十霜，归心日夜忆咸阳。无端更渡桑干水，却望并州是故乡。"], "思念": ["燕草如碧丝，秦桑低绿枝。当君怀归日，是妾断肠时。 春风不相识，何事入罗帏。", "袅袅城边柳，青青陌上桑。提笼忘采叶，昨夜梦渔阳。"], "送别": ["边烽警榆塞，侠客度桑干。柳叶开银镝，桃花照玉鞍。 满月临弓影，连星入剑端。不学燕丹客，空歌易水寒。", "向国唯看日，归帆但信风。鳌身映天黑，鱼眼射波红。乡树扶桑外，主人孤岛中。别离方异域，音信若为通。", "扶桑已在渺茫中，家在扶桑东更东。 此去与师谁共到，一船明月一帆风。"], "孤寂": [], "愁苦": [], "忧国忧民": ["逢君穆陵路，匹马向桑乾。楚国苍山古，幽州白日寒。城池百战后，耆旧几家残。处处蓬蒿遍，归人掩泪看。", "乃知兵者是凶器，圣人不得已而用之。。去年战，桑干源，今年战，葱河道。洗兵条支海上波，放马天山雪中草。", "我行倦风湍，辍棹将问津。空传歌瓠子，感慨独愁人。孟夏桑叶肥，秾阴夹长津。蚕农有时节，田野无闲人。", "坡陀望鄜畤，岩谷互出没。我行已水滨，我仆犹木末。鸱鸟鸣黄桑，野鼠拱乱穴。夜深经战场，寒月照白骨。", "万国城头吹画角，此曲哀怨何时终？。岁云暮矣多北风，潇湘洞庭白雪中。渔父天寒网罟冻，莫徭射雁鸣桑弓。去年米贵阙军食，今年米贱大伤农。"], "咏史怀古": ["专权意气本豪雄，青虬紫燕坐春风。自言歌舞长千载，自谓骄奢凌五公。节物风光不相待，桑田碧海须臾改。昔时金阶白玉堂，即今惟见青松在。", "君不见魏武草创争天禄，群雄睚毗相驰逐。昼携壮士破坚阵，夜接词人赋华屋。都邑缭绕西山阳，桑榆汗漫漳河曲。城郭为墟人代改，但见西园明月在。", "老当益壮，宁移白首之心？穷且益坚，不坠青云之志。酌贪泉而觉爽，处涸辙以犹欢。北海虽赊，扶摇可接；东隅已逝，桑榆非晚。孟尝高洁，空余报国之情；阮籍猖狂，岂效穷途之哭！　　勃，三尺微命，一介书生。"], "壮志难酬": [], "讽刺": ["乃知兵者是凶器，圣人不得已而用之。。去年战，桑干源，今年战，葱河道。洗兵条支海上波，放马天山雪中草。", "朝廷衮职虽多预，天下军储不自供。 稍喜临边王相国，肯销金甲事春农。回首扶桑铜柱标，冥冥氛祲未全销。越裳翡翠无消息，南海明珠久寂寥。", "桑条无叶土生烟，箫管迎龙水庙前。 朱门几处看歌舞，犹恐春阴咽管弦。", "天子好征战，百姓不种桑。天子好年少，无人荐冯唐。天子好美女，夫妇不成双。", "春风吹蚕细如蚁，桑芽才努青鸦嘴。侵晨采桑谁家女，手挽长条泪如雨。去岁初眠当此时，今岁春寒叶放迟。愁听门外催里胥，官家二月收新丝。"]}, "竹": {"爱情": ["。妾发初覆额，折花门前剧。郎骑竹马来，绕床弄青梅。同居长干里，两小无嫌猜。", "江水春沉沉，上有双竹林。竹叶坏水色，郎亦坏人心。", "江上朱楼新雨晴，瀼西春水縠文生。桥东桥西好杨柳，人来人去唱歌行。日出三竿春雾消，江头蜀客驻兰桡。凭寄狂夫书一纸，信在成都万里桥。", "遂令天下父母心，不重生男重生女。骊宫高处入青云，仙乐风飘处处闻。缓歌慢舞凝丝竹，尽日君王看不足。渔阳鼙鼓动地来，惊破霓裳羽衣曲。", "铜簧韵脆锵寒竹，新声慢奏移纤玉。眼色暗相钩，秋波横欲流。雨云深绣户，来便谐衷素。宴罢又成空，魂迷春梦中。"], "赞美": ["楼前百戏竞争新，唯有长竿妙入神。 谁谓绮罗翻有力，犹自嫌轻更著人。", "涩滩鸣嘈嘈，两山足猿猱。白波若卷雪，侧足不容舠。渔子与舟人，撑折万张篙。", "傲吏身闲笑五侯，西江取竹起高楼。南风不用蒲葵扇，纱帽闲眠对水鸥。", "去矣难重陈，飘然自兹始。游梁且未遇，适越今何以。乡山西北愁，竹箭东南美。峥嵘缙云外，苍莽几千里。", "侍婢卖珠回，牵萝补茅屋。摘花不插发，采柏动盈掬。天寒翠袖薄，日暮倚修竹。。"], "友情": ["穷途非所恨，虚室自相依。城阙居年满，琴尊俗事稀。 开襟方未已，分袂忽多违。东岩富松竹，岁暮幸同归。", "山光忽西落，池月渐东上。散发乘夕凉，开轩卧闲敞。荷风送香气，竹露滴清响。欲取鸣琴弹，恨无知音赏。感此怀故人，中宵劳梦想。", "踌躇未忍去，恋此四座人。饯离驻高驾，惜别空殷勤。何时竹林下，更与步兵邻。。", "谢亭离别处，风景每生愁。客散青天月，山空碧水流。池花春映日，窗竹夜鸣秋。今古一相接，长歌怀旧游。", "故人江海别，几度隔山川。乍见翻疑梦，相悲各问年。孤灯寒照雨，深竹暗浮烟。更有明朝恨，离杯惜共传。"], "励志": ["解落三秋叶，能开二月花。过江千尺浪，入竹万竿斜。", "一条藤径绿，万点雪峰晴。 地冷叶先尽，谷寒云不行。嫩篁侵舍密，古树倒江横。 白犬离村吠，苍苔壁上生。", "八月秋高风怒号，卷我屋上三重茅。茅飞渡江洒江郊，高者挂罥长林梢，下者飘转沉塘坳。南村群童欺我老无力，忍能对面为盗贼，公然抱茅入竹去。唇焦口燥呼不得，归来倚杖自叹息。", "　　遥襟甫畅，逸兴遄飞。爽籁发而清风生，纤歌凝而白云遏。睢园绿竹，气凌彭泽之樽；邺水朱华，光照临川之笔。四美具，二难并。"], "闲适": ["日日采莲去，洲长多暮归。弄篙莫溅水，畏湿红莲衣。", "傲吏身闲笑五侯，西江取竹起高楼。南风不用蒲葵扇，纱帽闲眠对水鸥。", "竹下忘言对紫茶，全胜羽客醉流霞。尘心洗尽兴难尽，一树蝉声片影斜。", "南州溽暑醉如酒，隐几熟眠开北牖。日午独觉无馀声，山童隔竹敲茶臼。", "山僧对棋坐，局上竹阴清。映竹无人见，时闻下子声。 小娃撑小艇，偷采白莲回。不解藏踪迹，浮萍一道开。"], "抒怀": ["解君云：“张茂先、何敬祖，东方生与其比肩。”仆亦以为知言也。故感叹雅制，作《修竹诗》一首，当有知音以传示之。 龙种生南岳，孤翠郁亭亭。", "白玉一杯酒，绿杨三月时。春风余几日，两鬓各成丝。秉烛唯须饮，投竿也未迟。如逢渭水猎，犹可帝王师。", "云汉尔固知，胡为不轻举。野人头尽白，与我忽相访。手持青竹竿，日暮淇水上。虽老美容色，虽贫亦闲放。", "钓鱼三十年，中心无所向。南登滑台上，却望河淇间。竹树夹流水，孤城对远山。念兹川路阔，羡尔沙鸥闲。", "北楼西望满晴空，积水连山胜画中。湍上急流声若箭，城头残月势如弓。垂竿已羡磻溪老，体道犹思塞上翁。为问边庭更何事，至今羌笛怨无穷。", "野步踏事少，病谋向物违。幽幽草根虫，生意与我微。竹风相戛语，幽闺暗中闻。鬼神满衰听，恍愡难自分。", "锄食难满腹，叶衣多丑躬。尘缕不自整，古吟将谁通。幽竹啸鬼神，楚铁生虬龙。志生多异感，运郁由邪衷。"], "思乡": ["山窗游玉女，涧户对琼峰。岩顶翔双凤，潭心倒九龙。酒中浮竹叶，杯上写芙蓉。故验家山赏，惟有风入松。", "南国辛居士，言归旧竹林。未逢调鼎用，徒有济川心。 予亦忘机者，田园在汉阴。因君故乡去，遥寄式微吟。", "坐到三更尽，归仍万里赊。雪声偏傍竹，寒梦不离家。晓角分残漏，孤灯落碎花。二年随骠骑，辛苦向天涯。", "独凭朱槛立凌晨，山色初明水色新。竹雾晓笼衔岭月，频风暖送过江春。子城阴处犹残雪，衙鼓声前未有尘。三百年来庾楼上，曾经多少望乡人。", "暖戏烟芜锦翼齐，品流应得近山鸡。雨昏青草湖边过，花落黄陵庙里啼。游子乍闻征袖湿，佳人才唱翠眉低。相呼相应湘江阔，苦竹丛深日向西。"], "思念": ["。妾发初覆额，折花门前剧。郎骑竹马来，绕床弄青梅。同居长干里，两小无嫌猜。", "寒更传晓箭，清镜览衰颜。隔牖风惊竹，开门雪满山。洒空深巷静，积素广庭闲。借问袁安舍，翛然尚闭关。", "微风惊暮坐，临牖思悠哉。开门复动竹，疑是故人来。时滴枝上露，稍沾阶下苔。何当一入幌，为拂绿琴埃。", "里巷千来往，都门五别离。岐分两回首，书到一开眉。叶落槐亭院，冰生竹阁池。雀罗谁问讯，鹤氅罢追随。", "露花烟草，寂寞五云三岛，正春深。貌减潜消玉，香残尚惹襟。竹疏虚槛静，松密醮坛阴。何事刘郎去？信沉沉。"], "送别": ["穷途非所恨，虚室自相依。城阙居年满，琴尊俗事稀。 开襟方未已，分袂忽多违。东岩富松竹，岁暮幸同归。", "苍苍竹林寺，杳杳钟声晚。荷笠带斜阳，青山独归远。", "南国辛居士，言归旧竹林。未逢调鼎用，徒有济川心。 予亦忘机者，田园在汉阴。因君故乡去，遥寄式微吟。", "踌躇未忍去，恋此四座人。饯离驻高驾，惜别空殷勤。何时竹林下，更与步兵邻。。", "去矣难重陈，飘然自兹始。游梁且未遇，适越今何以。乡山西北愁，竹箭东南美。峥嵘缙云外，苍莽几千里。"], "孤寂": ["莺语惊残梦，轻妆改泪容。竹阴初月薄，江静晚烟浓。 湿觜衔泥燕，香须采蕊蜂。独怜无限思，吟罢亚枝松。"], "愁苦": ["此身醒复醉，乘兴即为家。。苔径临江竹，茅檐覆地花。别来频甲子，倏忽又春华。"], "忧国忧民": ["九疑联绵皆相似，重瞳孤坟竟何是？帝子泣兮绿云间，随风波兮去无还。恸哭兮远望，见苍梧之深山。苍梧山崩湘水绝，竹上之泪乃可灭。。", "汉江回万里，派作九龙盘。横溃豁中国，崔嵬飞迅湍。六帝沦亡后，三吴不足观。我君混区宇，垂拱众流安。今日任公子，沧浪罢钓竿。", "云汉尔固知，胡为不轻举。野人头尽白，与我忽相访。手持青竹竿，日暮淇水上。虽老美容色，虽贫亦闲放。", "钓鱼三十年，中心无所向。南登滑台上，却望河淇间。竹树夹流水，孤城对远山。念兹川路阔，羡尔沙鸥闲。", "八月秋高风怒号，卷我屋上三重茅。茅飞渡江洒江郊，高者挂罥长林梢，下者飘转沉塘坳。南村群童欺我老无力，忍能对面为盗贼，公然抱茅入竹去。唇焦口燥呼不得，归来倚杖自叹息。"], "咏史怀古": ["瑶池西赴王母宴，七庙经年不亲荐。璧台南与盛姬游，明堂不复朝诸侯。《白云》《黄竹》歌声动，一人荒乐万人愁。周从后稷至文武，积德累功世勤苦。", "北湖南埭水漫漫，一片降旗百尺竿。三百年间同晓梦，钟山何处有龙盘。", "竹帛烟销帝业虚，关河空锁祖龙居。坑灰未冷山东乱，刘项原来不读书。", "　　遥襟甫畅，逸兴遄飞。爽籁发而清风生，纤歌凝而白云遏。睢园绿竹，气凌彭泽之樽；邺水朱华，光照临川之笔。四美具，二难并。"], "壮志难酬": ["露如微霰下前池，月过回塘万竹悲。浮世本来多聚散，红蕖何事亦离披？悠扬归梦惟灯见，濩落生涯独酒知。岂到白头长知尔，嵩阳松雪有心期。"], "讽刺": ["交柯之木本同形，东枝憔悴西枝荣。无心之物尚如此，参商胡乃寻天兵。孤竹延陵，让国扬名。高风缅邈，颓波激清。", "瑶池西赴王母宴，七庙经年不亲荐。璧台南与盛姬游，明堂不复朝诸侯。《白云》《黄竹》歌声动，一人荒乐万人愁。周从后稷至文武，积德累功世勤苦。", "瑶池阿母绮窗开，黄竹歌声动地哀。 八骏日行三万里，穆王何事不重来。", "竹帛烟销帝业虚，关河空锁祖龙居。坑灰未冷山东乱，刘项原来不读书。"]}, "梅": {"爱情": ["。妾发初覆额，折花门前剧。郎骑竹马来，绕床弄青梅。同居长干里，两小无嫌猜。", "含愁更奏绿绮琴，调高弦绝无知音。美人兮美人，不知为暮雨兮为朝云。相思一夜梅花发，忽到窗前疑是君。。"], "赞美": ["忽作出塞入塞声，白草胡沙寒飒飒。翻身入破如有神，前见后见回回新。始知诸曲不可比，采莲落梅徒聒耳。世人学舞只是舞，恣态岂能得如此。", "湖阔兼云雾，楼孤属晚晴。礼加徐孺子，诗接谢宣城。雪岸丛梅发，春泥百草生。敢违渔父问，从此更南征。"], "友情": ["畴昔通家好，相知无间然。续明催画烛，守岁接长筵。 旧曲梅花唱，新正柏酒传。客行随处乐，不见度年年。"], "励志": ["尘劳迥脱事非常，紧把绳头做一场。不经一番寒彻骨，怎得梅花扑鼻香。"], "闲适": ["暮景斜芳殿，年华丽绮宫。寒辞去冬雪，暖带入春风。阶馥舒梅素，盘花卷烛红。共欢新故岁，迎送一宵中。"], "抒怀": ["带雪梅初暖，含烟柳尚青。来窥童子偈，得听法王经。会理知无我，观空厌有形。迷心应觉悟，客思未遑宁。", "越绝孤城千万峰，空斋不语坐高舂。印文生绿经旬合，砚匣留尘尽日封。梅岭寒烟藏翡翠，桂江秋水露鰅鳙。丈人本自忘机事，为想年来憔悴容。", "早梅发高树，迥映楚天碧。朔吹飘夜香，繁霜滋晓白。欲为万里赠，杳杳山水隔。寒英坐销落，何用慰远客。"], "思乡": ["阳月南飞雁，传闻至此回。我行殊未已，何日复归来。江静潮初落，林昏瘴不开。明朝望乡处，应见陇头梅。", "独有宦游人，偏惊物候新。云霞出海曙，梅柳渡江春。淑气催黄鸟，晴光转绿蘋。忽闻歌古调，归思欲沾巾。", "一为迁客去长沙，西望长安不见家。 黄鹤楼中吹玉笛，江城五月落梅花。", "君自故乡来，应知故乡事。来日绮窗前，寒梅著花未？"], "思念": ["。妾发初覆额，折花门前剧。郎骑竹马来，绕床弄青梅。同居长干里，两小无嫌猜。", "窗外一株梅，寒花五出开。影随朝日远，香逐便风来。泣对铜钩障，愁看玉镜台。行人断消息，春恨几裴回。", "常有江南船，寄书家中否。 君自故乡来，应知故乡事。来日绮窗前，寒梅著花未。已见寒梅发，复闻啼鸟声。", " 君自故乡来，应知故乡事。来日绮窗前，寒梅著花未。已见寒梅发，复闻啼鸟声。心心视春草，畏向阶前生。", "闻道春还未相识，走傍寒梅访消息。昨夜东风入武阳，陌头杨柳黄金色。碧水浩浩云茫茫，美人不来空断肠。预拂青山一片石，与君连日醉壶觞。", "。人日题诗寄草堂，遥怜故人思故乡。柳条弄色不忍见，梅花满枝空断肠。身在远藩无所预，心怀百忧复千虑。"], "送别": ["路创李北海，岩开谢康乐。 松风和猿声，搜索连洞壑。径出梅花桥，双溪纳归潮。 落帆金华岸，赤松若可招。", "孤屿亭何处，天涯水气中。故人官就此，绝境与谁同。隐吏逢梅福，看山忆谢公。扁舟吾已僦，把钓待秋风。", "柳絮飞时别洛阳，梅花发后到三湘。 世情已逐浮云散，离恨空随江水长。"], "孤寂": ["越绝孤城千万峰，空斋不语坐高舂。印文生绿经旬合，砚匣留尘尽日封。梅岭寒烟藏翡翠，桂江秋水露鰅鳙。丈人本自忘机事，为想年来憔悴容。"], "愁苦": ["越绝孤城千万峰，空斋不语坐高舂。印文生绿经旬合，砚匣留尘尽日封。梅岭寒烟藏翡翠，桂江秋水露鰅鳙。丈人本自忘机事，为想年来憔悴容。"], "忧国忧民": ["一为迁客去长沙，西望长安不见家。 黄鹤楼中吹玉笛，江城五月落梅花。"], "咏史怀古": [], "壮志难酬": [], "讽刺": []}, "地钱": {"爱情": ["十六君远行，瞿塘滟滪堆。五月不可触，猿声天上哀。门前迟行迹，一一生绿苔。苔深不能扫，落叶秋风早。", "五月不可触，猿声天上哀。门前迟行迹，一一生绿苔。苔深不能扫，落叶秋风早。八月蝴蝶黄，双飞西园草。"], "赞美": ["水不在深，有龙则灵。斯是陋室，惟吾德馨。苔痕上阶绿，草色入帘青。谈笑有鸿儒，往来无白丁。"], "友情": [], "励志": [" 地冷叶先尽，谷寒云不行。嫩篁侵舍密，古树倒江横。 白犬离村吠，苍苔壁上生。穿厨孤雉过，临屋旧猿鸣。"], "闲适": ["公府日无事，吾徒只是闲。草根侵柱础，苔色上门关。饮砚时见鸟，卷帘晴对山。新诗吟未足，昨夜梦东还。"], "抒怀": ["南轩有孤松，柯叶自绵幂。清风无闲时，潇洒终日夕。阴生古苔绿，色染秋烟碧。何当凌云霄，直上数千尺。", "弱植不盈尺，远意驻蓬赢。月寒空阶曙，幽梦彩云生。粪壤擢珠树，莓苔插琼英。芳根閟颜色，徂岁为谁荣。", "夫子失古泪，当时落漼漼。诗老失古心，至今寒皑皑。古骨无浊肉，古衣如藓苔。劝君勉忍古，忍古销尘埃。", "。句吴亭东千里秋，放歌曾作昔年游。青苔寺里无马迹，绿水桥边多酒楼。大抵南朝皆旷达，可怜东晋最风流。", "金河秋半虏弦开，云外惊飞四散哀。仙掌月明孤影过，长门灯暗数声来。须知胡骑纷纷在，岂逐春风一一回？莫厌潇湘少人处，水多菰米岸莓苔。"], "思乡": ["潇湘何事等闲回，水碧沙明两岸苔。 二十五弦弹夜月，不胜清怨却飞来。", "远书归梦两悠悠，只有空床敌素秋。 阶下青苔与红树，雨中寥落月中愁。"], "思念": ["床中绣被卷不寝，至今三载闻余香。香亦竟不灭，人亦竟不来。相思黄叶落，白露湿青苔。。", "十六君远行，瞿塘滟滪堆。五月不可触，猿声天上哀。门前迟行迹，一一生绿苔。苔深不能扫，落叶秋风早。", "五月不可触，猿声天上哀。门前迟行迹，一一生绿苔。苔深不能扫，落叶秋风早。八月蝴蝶黄，双飞西园草。", "去年寄书报阳台，今年寄书重相催。 东风兮东风，为我吹行云使西来。待来竟不来，落花寂寂委青苔。。", "故园黄叶满青苔，梦破城头晓角哀。此夜断肠人不见，起行残月影徘徊。", "微风惊暮坐，临牖思悠哉。开门复动竹，疑是故人来。时滴枝上露，稍沾阶下苔。何当一入幌，为拂绿琴埃。"], "送别": [], "孤寂": ["密锁重关掩绿苔，廊深阁迥此徘徊。先知风起月含晕，尚自露寒花未开。蝙拂帘旌终展转，鼠翻窗网小惊猜。背灯独共馀香语，不觉犹歌起夜来。", "听夜雨冷滴芭蕉，惊断红窗好梦，龙烟细飘绣衾。辞恩久归长信，凤帐萧疏，椒殿闲扇。辇路苔侵。绣帘垂，迟迟漏传丹禁舜华偷悴，翠鬟羞整，愁坐望处，金舆渐远，何时彩仗重临？正消魂，梧桐又移翠阴。"], "愁苦": ["此身醒复醉，乘兴即为家。。苔径临江竹，茅檐覆地花。别来频甲子，倏忽又春华。"], "忧国忧民": [], "咏史怀古": [], "壮志难酬": [], "讽刺": ["百官朝下五门西。尘起春风过玉堤。黄帕盖鞍呈了马，红罗系项斗回鸡。馆松枝重墙头出，御柳条长水面齐。唯有教坊南草绿，古苔阴地冷凄凄。", "千秋佳节名空在，承露丝囊世已无。唯有紫苔偏称意，年年因雨上金铺。"]}, "香蒲": {"爱情": ["郎食鲤鱼尾，妾食猩猩唇。莫指襄阳道，绿浦归帆少。今日菖蒲花，明朝枫树老。。"], "赞美": ["连峰入户牖，胜概凌方壶。时作白纻词，放歌丹阳湖。水色傲溟渤，川光秀菰蒲。当其得意时，心与天壤俱。", "傲吏身闲笑五侯，西江取竹起高楼。南风不用蒲葵扇，纱帽闲眠对水鸥。", "谨状。。　　太尉始为泾州刺史时，汾阳王以副元帅居蒲。王子晞为尚书，领行营节度使，寓军邠州，纵士卒无赖。"], "友情": [], "励志": [], "闲适": ["清溪一道穿桃李，演漾绿蒲涵白芷。溪上人家凡几家，落花半落东流水。蹴踘屡过飞鸟上，秋千竞出垂杨里。少年分日作遨游，不用清明兼上巳。", "傲吏身闲笑五侯，西江取竹起高楼。南风不用蒲葵扇，纱帽闲眠对水鸥。", "遥闻境会茶山夜，珠翠歌钟俱绕身。盘下中分两州界，灯前各作一家春。青娥递舞应争妙，紫笋齐尝各斗新。自叹花时北窗下，蒲黄酒对病眠人。"], "抒怀": ["送君不相见，日暮独愁绪。江上空裴回，天边迷处所。 郡邑经樊邓，山河入嵩汝。蒲轮去渐遥，石径徒延伫。", "洞庭明月一千里，凉风雁啼天在水。九节菖蒲石上死，湘神弹琴迎帝子。山头老桂吹古香，雌龙怨吟寒水光。沙浦走鱼白石郎，闲取真珠掷龙堂。", "手风慵展一行书，眼暗休寻九局图。窗里日光飞野马，案头筠管长蒲卢。谋身拙为安蛇足，报国危曾捋虎须。 举世可能无默识，未知谁拟试齐竽。"], "思乡": ["萧萧山路穷秋雨，淅淅溪风一岸蒲。为问寒沙新到雁，来时还下杜陵无。"], "思念": [], "送别": ["送君不相见，日暮独愁绪。江上空裴回，天边迷处所。 郡邑经樊邓，山河入嵩汝。蒲轮去渐遥，石径徒延伫。"], "孤寂": ["送君不相见，日暮独愁绪。江上空裴回，天边迷处所。 郡邑经樊邓，山河入嵩汝。蒲轮去渐遥，石径徒延伫。", "空江浩荡景萧然，尽日菰蒲泊钓船。青草浪高三月渡，绿杨花扑一溪烟。情多莫举伤春目，愁极兼无买酒钱。犹有渔人数家住，不成村落夕阳边。"], "愁苦": [], "忧国忧民": [], "咏史怀古": ["汉家天马出蒲梢，苜蓿榴花遍近郊。内苑只知含凤觜，属车无复插鸡翘。玉桃偷得怜方朔，金屋修成贮阿娇。谁料苏卿老归国，茂陵松柏雨萧萧。"], "壮志难酬": [], "讽刺": ["洞庭明月一千里，凉风雁啼天在水。九节菖蒲石上死，湘神弹琴迎帝子。山头老桂吹古香，雌龙怨吟寒水光。沙浦走鱼白石郎，闲取真珠掷龙堂。", "汉家天马出蒲梢，苜蓿榴花遍近郊。内苑只知含凤觜，属车无复插鸡翘。玉桃偷得怜方朔，金屋修成贮阿娇。谁料苏卿老归国，茂陵松柏雨萧萧。"]}, "白茅": {"爱情": [], "赞美": ["但见新人笑，那闻旧人哭。在山泉水清，出山泉水浊。侍婢卖珠回，牵萝补茅屋。摘花不插发，采柏动盈掬。"], "友情": ["兴尽方下山，何必待之子。。绝顶一茅茨，直上三十里。扣关无僮仆，窥室唯案几。", "忘忧或假草，满院罗丛萱。暝色湖上来，微雨飞南轩。故人宿茅宇，夕鸟栖杨园。还惜诗酒别，深为江海言。", "僻巷邻家少，茅檐喜并居。蒸梨常共灶，浇薤亦同渠。 传屐朝寻药，分灯夜读书。虽然在城市，还得似樵渔。"], "励志": ["自经丧乱少睡眠，长夜沾湿何由彻?安得广厦千万间，大庇天下寒士俱欢颜，风雨不动安如山。呜呼！何时眼前突兀见此屋，吾庐独破受冻死亦足！。八月秋高风怒号，卷我屋上三重茅。茅飞渡江洒江郊，高者挂罥长林梢，下者飘转沉塘坳。", "呜呼！何时眼前突兀见此屋，吾庐独破受冻死亦足！。八月秋高风怒号，卷我屋上三重茅。茅飞渡江洒江郊，高者挂罥长林梢，下者飘转沉塘坳。南村群童欺我老无力，忍能对面为盗贼，公然抱茅入竹去。", "八月秋高风怒号，卷我屋上三重茅。茅飞渡江洒江郊，高者挂罥长林梢，下者飘转沉塘坳。南村群童欺我老无力，忍能对面为盗贼，公然抱茅入竹去。唇焦口燥呼不得，归来倚杖自叹息。"], "闲适": ["终南有茅屋，前对终南山。终年无客常闭关，终日无心长自闲。不妨饮酒复垂钓，君但能来相往还。"], "抒怀": ["结茅临古渡，卧见长淮流。窗里人将老，门前树已秋。寒山独过雁，暮雨远来舟。日夕逢归客，那能忘归游！", "”是二者，余未信之。。　　自西山道口径北，逾黄茅岭而下，有二道：其一西出，寻之无所得；其一少北而东，不过四十丈，土断而川分，有积石横当其垠。其上为睥睨、梁欐之形，其旁出堡坞，有若门焉。"], "思乡": ["松下茅亭五月凉，汀沙云树晚苍苍。行人无限秋风思，隔水青山似故乡。", "晨起动征铎，客行悲故乡。鸡声茅店月，人迹板桥霜。槲叶落山路，枳花明驿墙。因思杜陵梦，凫雁满回塘。"], "思念": [], "送别": ["我皇手把天地户，丹丘谈天与天语。九重出入生光辉，东来蓬莱复西归。玉浆倘惠故人饮，骑二茅龙上天飞。。", "陆有丘陵之险，虎豹之虞。江流悍急，横波之石，廉利侔剑戟，舟上下失势，破碎沦溺者，往往有之。县廓无居民，官无丞尉，夹江荒茅篁竹之间，小吏十余家，皆鸟言夷面。始至，言语不通，画地为字，然后可告以出租赋，奉期约。"], "孤寂": ["宛洛望不见，秋霖晦平陆。田父草际归，村童雨中牧。主人东皋上，时稼绕茅屋。虫思机杼悲，雀喧禾黍熟。"], "愁苦": ["此身醒复醉，乘兴即为家。。苔径临江竹，茅檐覆地花。别来频甲子，倏忽又春华。"], "忧国忧民": ["遂令半秦民，残害为异物。况我堕胡尘，及归尽华发。经年至茅屋，妻子衣百结。恸哭松声回，悲泉共幽咽。", "自经丧乱少睡眠，长夜沾湿何由彻?安得广厦千万间，大庇天下寒士俱欢颜，风雨不动安如山。呜呼！何时眼前突兀见此屋，吾庐独破受冻死亦足！。八月秋高风怒号，卷我屋上三重茅。茅飞渡江洒江郊，高者挂罥长林梢，下者飘转沉塘坳。", "呜呼！何时眼前突兀见此屋，吾庐独破受冻死亦足！。八月秋高风怒号，卷我屋上三重茅。茅飞渡江洒江郊，高者挂罥长林梢，下者飘转沉塘坳。南村群童欺我老无力，忍能对面为盗贼，公然抱茅入竹去。", "八月秋高风怒号，卷我屋上三重茅。茅飞渡江洒江郊，高者挂罥长林梢，下者飘转沉塘坳。南村群童欺我老无力，忍能对面为盗贼，公然抱茅入竹去。唇焦口燥呼不得，归来倚杖自叹息。", "渔父天寒网罟冻，莫徭射雁鸣桑弓。去年米贵阙军食，今年米贱大伤农。高马达官厌酒肉，此辈杼轴茅茨空。楚人重鱼不重鸟，汝休枉杀南飞鸿。", "半夜缘堤雪和雨，受他驱遣还复去。夜寒衣湿披短蓑，臆穿足裂忍痛何！到明辛苦无处说，齐声腾踏牵船歌。一间茅屋何所值，父母之乡去不得。我愿此水作平田，长使水夫不怨天。", "夫因兵死守蓬茅，麻苎衣衫鬓发焦。桑柘废来犹纳税，田园荒后尚征苗。时挑野菜和根煮，旋斫生柴带叶烧。任是深山更深处，也应无计避征徭。"], "咏史怀古": [], "壮志难酬": [], "讽刺": []}, "梧桐": {"爱情": ["归来池苑皆依旧，太液芙蓉未央柳。芙蓉如面柳如眉，对此如何不泪垂。春风桃李花开日，秋雨梧桐叶落时。西宫南内多秋草，落叶满阶红不扫。"], "赞美": [], "友情": ["只应物外攀琪树，便著霓裳上绛坛。 虚负凌云万丈才，一生襟抱未曾开。鸟啼花落人何在，竹死桐枯凤不来。良马足因无主踠，旧交心为绝弦哀。"], "励志": [], "闲适": [], "抒怀": ["仆尝暇时观齐、梁间诗，彩丽竞繁，而兴寄都绝，每以永叹。思古人，常恐逶迤颓靡，风雅不作，以耿耿也。一昨于解三处，见明公《咏孤桐篇》，骨气端翔，音情顿挫，光英朗练，有金石声。遂用洗心饰视，发挥幽郁。", "一朝和殷羹，光气为列星。伊尹生空桑，捐庖佐皇极。桐宫放太甲，摄政无愧色。三年帝道明，委质终辅翼。", "席上印病文，肠中转愁盘。疑怀无所凭，虚听多无端。棓桐枯峥嵘，声响如哀弹。一尺月透户，仡栗如剑飞。", "哀哉轻薄行，终日与驷驰。流运闪欲尽，枯折皆相号。棘枝风哭酸，桐叶霜颜高。老虫干铁鸣，惊兽孤玉咆。"], "思乡": [], "思念": ["荒城自萧索，万里山河空。天高秋日迥，嘹唳闻归鸿。寒塘映衰草，高馆落疏桐。临此岁方晏，顾景咏悲翁。故人不可见，寂寞平陵东。", "白露披梧桐，玄蝉昼夜号。秋风万里动，日暮黄云高。 君子佐休明，小人事蓬蒿。所适在鱼鸟，焉能徇锥刀。 孤舟向广武，一鸟归成皋。胜概日相与，思君心郁陶。", "零落桐叶雨，萧条槿花风。悠悠早秋意，生此幽闲中。 况与故人别，中怀正无悰。勿云不相送，心到青门东。 相知岂在多，但问同不同。同心一人去，坐觉长安空。", "苦思搜诗灯下吟，不眠长夜怕寒衾。满庭木叶愁风起，透幌纱窗惜月沈。疏散未闲终遂愿，盛衰空见本来心。幽栖莫定梧桐处，暮雀啾啾空绕林。", "落日斜，秋风冷。今夜故人来不来，教人立尽梧桐影。"], "送别": ["闻道故林相识多，罢官昨日今如何。。四月南风大麦黄，枣花未落桐叶长。青山朝别暮还见，嘶马出门思旧乡。"], "孤寂": ["零落桐叶雨，萧条槿花风。悠悠早秋意，生此幽闲中。 况与故人别，中怀正无悰。勿云不相送，心到青门东。 相知岂在多，但问同不同。同心一人去，坐觉长安空。", "洞房深，画屏灯照，山色凝翠沉沉。听夜雨冷滴芭蕉，惊断红窗好梦，龙烟细飘绣衾。辞恩久归长信，凤帐萧疏，椒殿闲扇。辇路苔侵。绣帘垂，迟迟漏传丹禁舜华偷悴，翠鬟羞整，愁坐望处，金舆渐远，何时彩仗重临？正消魂，梧桐又移翠阴。"], "愁苦": [], "忧国忧民": [], "咏史怀古": ["江城如画里，山晚望晴空。两水夹明镜，双桥落彩虹。人烟寒橘柚，秋色老梧桐。谁念北楼上，临风怀谢公。"], "壮志难酬": [], "讽刺": []}, "藜": {"爱情": ["玉容寂寞泪阑干，梨花一枝春带雨。含情凝睇谢君王，一别音容两渺茫。昭阳殿里恩爱绝，蓬莱宫中日月长。回头下望人寰处，不见长安见尘雾。"], "赞美": ["腊月草根甜，天街雪似盐。未知口硬软，先拟蒺藜衔。"], "友情": [], "励志": [], "闲适": [], "抒怀": ["万里春应尽，三江雁亦稀。连天汉水广，孤客郢城归。郧国稻苗秀，楚人菰米肥。悬知倚门望，遥识老莱衣。", "弃我去者，昨日之日不可留；乱我心者，今日之日多烦忧。长风万里送秋雁，对此可以酣高楼。蓬莱文章建安骨，中间小谢又清发。俱怀逸兴壮思飞，欲上青天览明月。", "人生无家别，何以为蒸黎。。寂寞天宝后，园庐但蒿藜。我里百余家，世乱各东西。", "揽衣中夜起，感物涕盈襟。微霜众所践，谁念岁寒心。 旭日照寒野，鸒斯起蒿莱。啁啾有馀乐，飞舞西陵隈。", "还如刻削形，免有纤悉聪。浪浪谢初始，皎皎幸归终。孤隔文章友，亲密蒿莱翁。岁绿闵似黄，秋节迸已穷。", "黄河倒上天，众水有却来。人心不及水，一直去不回。一直亦有巧，不肯至蓬莱。一直不知疲，唯闻至省台。"], "思乡": [], "思念": [], "送别": ["万里春应尽，三江雁亦稀。连天汉水广，孤客郢城归。郧国稻苗秀，楚人菰米肥。悬知倚门望，遥识老莱衣。", "明星玉女备洒扫，麻姑搔背指爪轻。我皇手把天地户，丹丘谈天与天语。九重出入生光辉，东来蓬莱复西归。玉浆倘惠故人饮，骑二茅龙上天飞。", "诗卷长留天地间，钓竿欲拂珊瑚树。深山大泽龙蛇远，春寒野阴风景暮。蓬莱织女回云车，指点虚无是归路。自是君身有仙骨，世人那得知其故。", "兵戈不见老莱衣，叹息人间万事非。我已无家寻弟妹，君今何处访庭闱？黄牛峡静滩声转，白马江寒树影稀。此别应须各努力，故乡犹恐未同归。"], "孤寂": [], "愁苦": [], "忧国忧民": ["。冰峰撑空寒矗矗，云凝水冻埋海陆。 杀物之性，伤人之欲，既不能断绝蒺藜荆棘之根株， 又不能展凤凰麒麟之拳跼。如此则何如为和煦，为膏雨， 自然天下之荣枯，融融于万户。", "直北关山金鼓振，征西车马羽书驰。鱼龙寂寞秋江冷，故国平居有所思。蓬莱宫阙对南山，承露金茎霄汉间。西望瑶池降王母，东来紫气满函关。", "牵裾惊魏帝，投阁为刘歆。狂走终奚适，微才谢所钦。吾安藜不糁，汝贵玉为琛。乌几重重缚，鹑衣寸寸针。", " 古来一人耕，三人食犹饥。如今千万家，无一把锄犁。 我仓常空虚，我田生蒺藜。上天不雨粟，何由活烝黎。"], "咏史怀古": [], "壮志难酬": [], "讽刺": ["渤澥声中涨小堤，官家知后海鸥知。蓬莱有路教人到，应亦年年税紫芝。"]}, "稻": {"爱情": [], "赞美": [], "友情": ["才高心不展，道屈善无邻。处士祢衡俊，诸生原宪贫。稻粱求未足，薏苡谤何频。五岭炎蒸地，三危放逐臣。"], "励志": [], "闲适": [], "抒怀": ["万里春应尽，三江雁亦稀。连天汉水广，孤客郢城归。郧国稻苗秀，楚人菰米肥。悬知倚门望，遥识老莱衣。", "唐剑斩隋公，拳毛属太宗。莫嫌金甲重，且去捉飘风。白铁锉青禾，砧间落细莎。世人怜小颈，金埒畏长牙。", "金河秋半虏弦开，云外惊飞四散哀。仙掌月明孤影过，长门灯暗数声来。须知胡骑纷纷在，岂逐春风一一回？莫厌潇湘少人处，水多菰米岸莓苔。"], "思乡": [], "思念": ["四月一日天，花稀叶阴薄。泥新燕影忙，蜜熟蜂声乐。麦风低冉冉，稻水平漠漠。芳节或蹉跎，游心稍牢落。"], "送别": ["万里春应尽，三江雁亦稀。连天汉水广，孤客郢城归。郧国稻苗秀，楚人菰米肥。悬知倚门望，遥识老莱衣。", "海内兵方起，离筵泪易垂。怜君负米去，惜此落花时。想忆看来信，相宽指后期。殷勤手中柳，此是向南枝。"], "孤寂": ["田父草际归，村童雨中牧。主人东皋上，时稼绕茅屋。虫思机杼悲，雀喧禾黍熟。明当渡京水，昨晚犹金谷。"], "愁苦": [], "忧国忧民": ["边庭流血成海水，武皇开边意未已。君不闻汉家山东二百州，千村万落生荆杞。纵有健妇把锄犁，禾生陇亩无东西。况复秦兵耐苦战，被驱不异犬与鸡。", "吾宁舍一哀，里巷亦呜咽。所愧为人父，无食致夭折。岂知秋禾登，贫窭有仓卒。生常免租税，名不隶征伐。", "岁云暮矣多北风，潇湘洞庭白雪中。渔父天寒网罟冻，莫徭射雁鸣桑弓。去年米贵阙军食，今年米贱大伤农。高马达官厌酒肉，此辈杼轴茅茨空。", "昆明池水汉时功，武帝旌旗在眼中。织女机丝虚夜月，石鲸鳞甲动秋风。波漂菰米沉云黑，露冷莲房坠粉红。关塞极天惟鸟道，江湖满地一渔翁。", "关塞极天惟鸟道，江湖满地一渔翁。昆吾御宿自逶迤，紫阁峰阴入渼陂。香稻啄馀鹦鹉粒，碧梧栖老凤凰枝。佳人拾翠春相问，仙侣同舟晚更移。", "杜陵叟，杜陵居，岁种薄田一顷余。三月无雨旱风起，麦苗不秀多黄死。九月降霜秋早寒，禾穗未熟皆青乾。长吏明知不申破，急敛暴征求考课。"], "咏史怀古": ["白璧黄金万户侯，宝刀骏马填山丘，年代凄凉不可问，往来唯见水东流。。古城莽苍饶荆榛，驱马荒城愁杀人，魏王宫观尽禾黍，信陵宾客随灰尘。忆昨雄都旧朝市，轩车照耀歌钟起，军容带甲三十万，国步连营一千里。", "玉树歌残王气终，景阳兵合戍楼空。松楸远近千官冢，禾黍高低六代宫。石燕拂云晴亦雨，江豚吹浪夜还风。英雄一去豪华尽，惟有青山似洛中。"], "壮志难酬": [], "讽刺": ["种花满西园，花发青楼道。花下一禾生，去之为恶草。", "父耕原上田，子劚山下荒。六月禾未秀，官家已修仓。"]}, "枫": {"爱情": ["郎食鲤鱼尾，妾食猩猩唇。莫指襄阳道，绿浦归帆少。今日菖蒲花，明朝枫树老。。"], "赞美": [], "友情": ["意气今何在，相思望斗牛。。洞庭去远近，枫叶早惊秋。岘首羊公爱，长沙贾谊愁。"], "励志": [], "闲适": [], "抒怀": ["春岸桃花水，云帆枫树林。偷生长避地，适远更沾襟。老病南征日，君恩北望心。百年歌自苦，未见有知音。"], "思乡": ["摇落暮天迥，青枫霜叶稀。孤城向水闭，独鸟背人飞。渡口月初上，邻家渔未归。乡心正欲绝，何处捣寒衣。", "月落乌啼霜满天，江枫渔火对愁眠。姑苏城外寒山寺，夜半钟声到客船。"], "思念": ["江畔何人初见月？江月何年初照人？人生代代无穷已，江月年年望相似。不知江月待何人，但见长江送流水。白云一片去悠悠，青枫浦上不胜愁。谁家今夜扁舟子？何处相思明月楼？可怜楼上月徘徊，应照离人妆镜台。", "枫叶千枝复万枝，江桥掩映暮帆迟。 忆君心似西江水，日夜东流无歇时。", "玉露凋伤枫树林，巫山巫峡气萧森。江间波浪兼天涌，塞上风云接地阴。丛菊两开他日泪，孤舟一系故园心。寒衣处处催刀尺，白帝城高急暮砧。"], "送别": ["城下沧江水，江边黄鹤楼。朱阑将粉堞，江水映悠悠。铙吹发夏口，使君居上头。郭门隐枫岸，侯吏趋芦洲。何异临川郡，还劳康乐侯。", "嗟君此别意何如，驻马衔杯问谪居。巫峡啼猿数行泪，衡阳归雁几封书。青枫江上秋帆远，白帝城边古木疏。圣代即今多雨露，暂时分手莫踌躇。", "红叶晚萧萧，长亭酒一瓢。残云归太华，疏雨过中条。树色随山迥，河声入海遥。帝乡明日到，犹自梦渔樵。", "劳歌一曲解行舟，红叶青山水急流。 日暮酒醒人已远，满天风雨下西楼。"], "孤寂": ["满庭诗境飘红叶，绕砌琴声滴暗泉。门外晚晴秋色老，万条寒玉一溪烟。"], "愁苦": ["红叶醉秋色，碧溪弹夜弦。佳期不可再，风雨杳如年。"], "忧国忧民": ["春岸桃花水，云帆枫树林。偷生长避地，适远更沾襟。老病南征日，君恩北望心。百年歌自苦，未见有知音。", "彩笔昔曾干气象，白头吟望苦低垂。。玉露凋伤枫树林，巫山巫峡气萧森。江间波浪兼天涌，塞上风云接地阴。", "如闻马融笛，若倚仲宣襟。故国悲寒望，群云惨岁阴。水乡霾白屋，枫岸叠青岑。郁郁冬炎瘴，濛濛雨滞淫。"], "咏史怀古": ["沅湘流不尽，屈子怨何深。日暮秋风起，萧萧枫树林。", "辇路江枫暗，宫庭野草春。伤心庾开府，老作北朝臣。", "湘波如泪色漻漻，楚厉迷魂逐恨遥。枫树夜猿愁自断，女萝山鬼语相邀。空归腐败犹难复，更困腥臊岂易招？但使故乡三户在，彩丝谁惜惧长蛟。"], "壮志难酬": [], "讽刺": []}, "菊花": {"爱情": [], "赞美": [], "友情": ["故人具鸡黍，邀我至田家。绿树村边合，青山郭外斜。开轩面场圃，把酒话桑麻。待到重阳日，还来就菊花。", "故交竟谁在，独有崔亭伯。重阳不相知，载酒任所适。手持一枝菊，调笑二千石。日暮岸帻归，传呼隘阡陌。", "少时犹不忧生计，老后谁能惜酒钱？共把十千沽一斗，相看七十欠三年。闲征雅令穷经史，醉听清吟胜管弦。更待菊黄家酝熟，共君一醉一陶然。"], "励志": ["昔看黄菊与君别，今听玄蝉我却回。五夜飕飗枕前觉，一年颜状镜中来。马思边草拳毛动，雕眄青云睡眼开。天地肃清堪四望，为君扶病上高台。"], "闲适": [], "抒怀": ["大唐造昌运，品物荷时成。乘秋逢令节，锡宴观群情。俯临秦山川，高会汉公卿。未追赤松子，且泛黄菊英。赓歌圣人作，海内同休明。", "庭前甘菊移时晚，青蕊重阳不堪摘。明日萧条醉尽醒，残花烂熳开何益？篱边野外多众芳，采撷细琐升中堂。念兹空长大枝叶，结根失所缠风霜。", "蹇行散馀郁，幽坐谁与曹。抽壮无一线，剪怀盈千刀。清诗既名朓，金菊亦姓陶。收拾昔所弃，咨嗟今比毛。", "秋丛绕舍似陶家，遍绕篱边日渐斜。 不是花中偏爱菊，此花开尽更无花。"], "思乡": ["强欲登高去，无人送酒来。遥怜故园菊，应傍战场开。", "雨匀紫菊丛丛色，风弄红蕉叶叶声。北畔是山南畔海，只堪图画不堪行。"], "思念": ["重阳独酌杯中酒，抱病起登江上台。竹叶于人既无分，菊花从此不须开。殊方日落玄猿哭，旧国霜前白雁来。弟妹萧条各何在，干戈衰谢两相催！", "玉露凋伤枫树林，巫山巫峡气萧森。江间波浪兼天涌，塞上风云接地阴。丛菊两开他日泪，孤舟一系故园心。寒衣处处催刀尺，白帝城高急暮砧。"], "送别": [], "孤寂": ["老信相如渴，贫忧曼倩饥。生公与园吏，何处是吾师?蓟北雁犹远，淮南人已悲。残桃间堕井，新菊亦侵篱。书剑岂相误，琴樽聊自持。"], "愁苦": ["少时犹不忧生计，老后谁能惜酒钱？共把十千沽一斗，相看七十欠三年。闲征雅令穷经史，醉听清吟胜管弦。更待菊黄家酝熟，共君一醉一陶然。"], "忧国忧民": ["邠郊入地底，泾水中荡潏。猛虎立我前，苍崖吼时裂。菊垂今秋花，石戴古车辙。青云动高兴，幽事亦可悦。", "玉露凋伤枫树林，巫山巫峡气萧森。江间波浪兼天涌，塞上风云接地阴。丛菊两开他日泪，孤舟一系故园心。寒衣处处催刀尺，白帝城高急暮砧。"], "咏史怀古": [], "壮志难酬": [], "讽刺": []}, "稷": {"爱情": [], "赞美": ["金陵风景好，豪士集新亭。举目山河异，偏伤周顗情。四坐楚囚悲，不忧社稷倾。王公何慷慨，千载仰雄名。"], "友情": ["故人具鸡黍，邀我至田家。绿树村边合，青山郭外斜。开轩面场圃，把酒话桑麻。待到重阳日，还来就菊花。"], "励志": ["披云睹青天，扪虱话良图。留侯将绮里，出处未云殊。终与安社稷，功成去五湖。。"], "闲适": [], "抒怀": ["何意薄松筠，翻然重菅蒯。 恒深取与分，孰慢平生契。款曲鸡黍期，酸辛别离袂。 逢时愧名节，遇坎悲沦替。", "犹瞻太白雪，喜遇武功天。影静千官里，心苏七校前。今朝汉社稷，新数中兴年。。"], "思乡": [], "思念": [], "送别": ["何意薄松筠，翻然重菅蒯。 恒深取与分，孰慢平生契。款曲鸡黍期，酸辛别离袂。 逢时愧名节，遇坎悲沦替。"], "孤寂": ["田父草际归，村童雨中牧。主人东皋上，时稼绕茅屋。虫思机杼悲，雀喧禾黍熟。明当渡京水，昨晚犹金谷。"], "愁苦": [], "忧国忧民": ["。杜陵有布衣，老大意转拙。许身一何愚，窃比稷与契。居然成濩落，白首甘契阔。"], "咏史怀古": ["金陵风景好，豪士集新亭。举目山河异，偏伤周顗情。四坐楚囚悲，不忧社稷倾。王公何慷慨，千载仰雄名。", "白璧黄金万户侯，宝刀骏马填山丘，年代凄凉不可问，往来唯见水东流。。古城莽苍饶荆榛，驱马荒城愁杀人，魏王宫观尽禾黍，信陵宾客随灰尘。忆昨雄都旧朝市，轩车照耀歌钟起，军容带甲三十万，国步连营一千里。", "璧台南与盛姬游，明堂不复朝诸侯。《白云》《黄竹》歌声动，一人荒乐万人愁。周从后稷至文武，积德累功世勤苦。岂知才及四代孙，心轻王业如灰土。", "玉树歌残王气终，景阳兵合戍楼空。松楸远近千官冢，禾黍高低六代宫。石燕拂云晴亦雨，江豚吹浪夜还风。英雄一去豪华尽，惟有青山似洛中。"], "壮志难酬": [], "讽刺": ["岂谓尽烦回纥马，翻然远救朔方兵。胡来不觉潼关隘，龙起犹闻晋水清。独使至尊忧社稷，诸君何以答升平。洛阳宫殿化为烽，休道秦关百二重。", "璧台南与盛姬游，明堂不复朝诸侯。《白云》《黄竹》歌声动，一人荒乐万人愁。周从后稷至文武，积德累功世勤苦。岂知才及四代孙，心轻王业如灰土。", " 　　敬业皇唐旧臣，公侯冢子。奉先帝之成业，荷本朝之厚恩。宋微子之兴悲，良有以也；袁君山之流涕，岂徒然哉！是用气愤风云，志安社稷。因天下之失望，顺宇内之推心，爰举义旗，以清妖孽。"]}, "大麻": {"爱情": [], "赞美": ["杜诗韩笔愁来读，似倩麻姑痒处搔。天外凤凰谁得髓？无人解合续弦胶。"], "友情": ["故人具鸡黍，邀我至田家。绿树村边合，青山郭外斜。开轩面场圃，把酒话桑麻。待到重阳日，还来就菊花。", "别君莫道不尽欢，悬知乐客遥相待。石门流水遍桃花，我亦曾到秦人家。不知何处得鸡豕，就中仍见繁桑麻。翛然远与世事间，装鸾驾鹤又复远。"], "励志": ["俄顷风定云墨色，秋天漠漠向昏黑。布衾多年冷似铁，娇儿恶卧踏里裂。床头屋漏无干处，雨脚如麻未断绝。自经丧乱少睡眠，长夜沾湿何由彻?安得广厦千万间，大庇天下寒士俱欢颜，风雨不动安如山。"], "闲适": [], "抒怀": ["何当金络脑，快走踏清秋。饥卧骨查牙，粗毛刺破花。鬣焦珠色落，发断锯长麻。西母酒将阑，东王饭已干。", "鸦翎羽箭山桑弓，仰天射落衔芦鸿。麻衣黑肥冲北风，带酒日晚歌田中。男儿屈穷心不穷，枯荣不等嗔天公。寒风又变为春柳，条条看即烟濛濛。"], "思乡": ["泛舟大河里，积水穷天涯。天波忽开拆，郡邑千万家。行复见城市，宛然有桑麻。回瞻旧乡国，渺漫连云霞。"], "思念": [], "送别": ["白帝金精运元气，石作莲花云作台。云台阁道连窈冥，中有不死丹丘生。明星玉女备洒扫，麻姑搔背指爪轻。我皇手把天地户，丹丘谈天与天语。"], "孤寂": [], "愁苦": [], "忧国忧民": ["俄顷风定云墨色，秋天漠漠向昏黑。布衾多年冷似铁，娇儿恶卧踏里裂。床头屋漏无干处，雨脚如麻未断绝。自经丧乱少睡眠，长夜沾湿何由彻?安得广厦千万间，大庇天下寒士俱欢颜，风雨不动安如山。", "典桑卖地纳官租，明年衣食将何如？剥我身上帛，夺我口中粟。虐人害物即豺狼，何必钩爪锯牙食人肉？不知何人奏皇帝，帝心恻隐知人弊。白麻纸上书德音，京畿尽放今年税。昨日里胥方到门，手持敕牒榜乡村。", "夫因兵死守蓬茅，麻苎衣衫鬓发焦。桑柘废来犹纳税，田园荒后尚征苗。时挑野菜和根煮，旋斫生柴带叶烧。任是深山更深处，也应无计避征徭。", "粉色全无饥色加，岂知人世有荣华。 年年道我蚕辛苦，底事浑身着苎麻。"], "咏史怀古": [], "壮志难酬": [], "讽刺": ["粉色全无饥色加，岂知人世有荣华。 年年道我蚕辛苦，底事浑身着苎麻。"]}, "芦苇": {"爱情": ["绿江深见底，高浪直翻空。惯是湖边住，舟轻不畏风。 逐流牵荇叶，缘岸摘芦苗。为惜鸳鸯鸟，轻轻动画桡。"], "赞美": ["天山雪云常不开，千峰万岭雪崔嵬。北风夜卷赤亭口，一夜天山雪更厚。能兼汉月照银山，复逐胡风过铁关。交河城边鸟飞绝，轮台路上马蹄滑。", "湖阔兼云雾，楼孤属晚晴。礼加徐孺子，诗接谢宣城。雪岸丛梅发，春泥百草生。敢违渔父问，从此更南征。"], "友情": ["天山雪云常不开，千峰万岭雪崔嵬。北风夜卷赤亭口，一夜天山雪更厚。能兼汉月照银山，复逐胡风过铁关。交河城边鸟飞绝，轮台路上马蹄滑。", "白日来深殿，青云满后尘。乞归优诏许，遇我宿心亲。未负幽栖志，兼全宠辱身。剧谈怜野逸，嗜酒见天真。", "舍南舍北皆春水，但见群鸥日日来。花径不曾缘客扫，蓬门今始为君开。盘飧市远无兼味，樽酒家贫只旧醅。肯与邻翁相对饮，隔篱呼取尽馀杯。", "林山相晚暮，天海空青苍。 暝色况复久，秋声亦何长。孤舟兼微月，独夜仍越乡。 寒笛对京口，故人在襄阳。"], "励志": [], "闲适": ["清溪一道穿桃李，演漾绿蒲涵白芷。溪上人家凡几家，落花半落东流水。蹴踘屡过飞鸟上，秋千竞出垂杨里。少年分日作遨游，不用清明兼上巳。"], "抒怀": [" 昨日绣衣倾绿尊，病如桃李竟何言。昔骑天子大宛马，今乘款段诸侯门。赖遇南平豁方寸，复兼夫子持清论。 有似山开万里云，四望青天解人闷。", "试共野人言，深觉农夫苦。去秋虽薄熟，今夏犹未雨。耕耘日勤劳，租税兼舄卤。园蔬空寥落，产业不足数。", "鸦翎羽箭山桑弓，仰天射落衔芦鸿。麻衣黑肥冲北风，带酒日晚歌田中。男儿屈穷心不穷，枯荣不等嗔天公。寒风又变为春柳，条条看即烟濛濛。", "世间荣落重逡巡，我独丘园坐四春。纵使有花兼有月，可堪无酒又无人。青袍似草年年定，白发如丝日日新。欲逐风波千万里，未知何路到龙津。"], "思乡": ["落帆逗淮镇，停舫临孤驿。浩浩风起波，冥冥日沉夕。 人归山郭暗，雁下芦洲白。独夜忆秦关，听钟未眠客。", "。自河南经乱，关内阻饥，兄弟离散，各在一处。因望月有感，聊书所怀，寄上浮梁大兄、於潜七兄、乌江十五兄，兼示符离及下邽弟妹。 时难年荒世业空，弟兄羁旅各西东。", "聊凭危堞望，暗起异乡情。霜落蒹葭白，山昏雾露生。河滩胡雁下，戎垒汉鼙惊。独树残秋色，狂歌泪满缨。"], "思念": ["苜蓿峰边逢立春，胡芦河上泪沾巾。闺中只是空相忆，不见沙场愁杀人。", "林山相晚暮，天海空青苍。 暝色况复久，秋声亦何长。孤舟兼微月，独夜仍越乡。 寒笛对京口，故人在襄阳。", "回乐峰前沙似雪，受降城外月如霜。不知何处吹芦管，一夜征人尽望乡。", "玉露凋伤枫树林，巫山巫峡气萧森。江间波浪兼天涌，塞上风云接地阴。丛菊两开他日泪，孤舟一系故园心。寒衣处处催刀尺，白帝城高急暮砧。"], "送别": ["城下沧江水，江边黄鹤楼。朱阑将粉堞，江水映悠悠。铙吹发夏口，使君居上头。郭门隐枫岸，侯吏趋芦洲。何异临川郡，还劳康乐侯。", "八月寒苇花，秋江浪头白。北风吹五两，谁是浔阳客。鸬鹚山头微雨晴，扬州郭里暮潮生。行人夜宿金陵渚，试听沙边有雁声。", "天山雪云常不开，千峰万岭雪崔嵬。北风夜卷赤亭口，一夜天山雪更厚。能兼汉月照银山，复逐胡风过铁关。交河城边鸟飞绝，轮台路上马蹄滑。"], "孤寂": ["空江浩荡景萧然，尽日菰蒲泊钓船。青草浪高三月渡，绿杨花扑一溪烟。情多莫举伤春目，愁极兼无买酒钱。犹有渔人数家住，不成村落夕阳边。"], "愁苦": ["世间荣落重逡巡，我独丘园坐四春。纵使有花兼有月，可堪无酒又无人。青袍似草年年定，白发如丝日日新。欲逐风波千万里，未知何路到龙津。"], "忧国忧民": ["试共野人言，深觉农夫苦。去秋虽薄熟，今夏犹未雨。耕耘日勤劳，租税兼舄卤。园蔬空寥落，产业不足数。", "。玉露凋伤枫树林，巫山巫峡气萧森。江间波浪兼天涌，塞上风云接地阴。丛菊两开他日泪，孤舟一系故园心。", "听猿实下三声泪，奉使虚随八月槎。画省香炉违伏枕，山楼粉堞隐悲笳。请看石上藤萝月，已映洲前芦荻花。千家山郭静朝晖，日日江楼坐翠微。", "新丰老翁八十八，头鬓眉须皆似雪。玄孙扶向店前行，左臂凭肩右臂折。问翁臂折来几年，兼问致折何因缘。翁云贯属新丰县，生逢圣代无征战。"], "咏史怀古": ["王濬楼船下益州，金陵王气黯然收。千寻铁锁沉江底，一片降幡出石头。人世几回伤往事，山形依旧枕寒流。今逢四海为家日，故垒萧萧芦荻秋。"], "壮志难酬": [], "讽刺": ["清秋望不极，迢遰起曾阴。远水兼天净，孤城隐雾深。叶稀风更落，山迥日初沉。独鹤归何晚，昏鸦已满林。", "朝牧牛，牧牛下江曲。夜牧牛，牧牛度村谷。荷蓑出林春雨细，芦管卧吹莎草绿。乱插蓬蒿箭满腰，不怕猛虎欺黄犊。", "蝉鸣空桑林，八月萧关道。出塞入塞寒，处处黄芦草。从来幽并客，皆共沙尘老。莫学游侠儿，矜夸紫骝好。"]}}
var mychart = echarts.init(document.getElementById("chart"));
option = {
    //color:['rgb(238,63,77,0.65)','rgb(236,155,173,0.8)','rgb(252,161,6,0.7)','rgb(244,206,105)','rgb(208,222,170)','rgb(140,194,105)','rgb(93,190,138)','rgb(147,213,220)','rgb(147,181,207)','rgb(17,101,154,0.7)','rgb(94,121,135,0.8)','rgb(73,92,105)','rgb(20,35,32,0.8)','rgb(19,24,36,0.8)','rgb(0,0,0,0.8)'],
    //color:['rgb(249,236,195,0.8)','rgb(214,227,197)','rgb(192,217,188)','rgb(162,200,173)','rgb(133,180,160)','rgb(94,147,139)','rgb(93,147,139)','rgb(74,125,124)','rgb(66,114,118)','rgb(65,101,109)','rgb(62,100,113)','rgb(60,100,115)','rgb(54,90,106)','rgb(47,78,98)','rgb(42,70,91)','rgb(35,57,81)'],
    //color:['rgb(182,42,45,0.9)','rgb(182,42,45,0.7)','rgb(244,105,74,0.8)','rgb(244,105,74,0.6)','rgb(238,171,41,0.8)','rgb(238,171,41,0.6)','rgb(108,166,128,0.6)','rgb(108,166,128,0.8)','rgb(83,122,72,0.6)','rgb(83,122,72,0.7)','rgb(126,145,186,0.85)','rgb(126,145,186,1)','rgb(101,92,133,0.85)','rgb(101,92,133,1)','rgb(87,79,115,0.95)'],
    color: ['rgb(189,63,66)', 'rgb(204,105,108)', 'rgb(246,135,110)', 'rgb(248,165,146)', 'rgb(241,188,84)', 'rgb(245,205,127)', 'rgb(167,202,179)', 'rgb(137,184,153)', 'rgb(152,175,145)', 'rgb(134,162,127)', 'rgb(145,161,196)', 'rgb(126,145,186)', 'rgb(124,116,151)', 'rgb(101,92,133)', 'rgb(96,88,122)'],
        /*formatter(params) {
            for (x in params) {
                console.log("x:" + x);
                plant = params[x].axisValue;
                sense = params[x].seriesName;
                console.log(params);
                console.log("sense:"+sense);
                content = poets_dataset[plant][sense];
                var i;
                var strcontent = "<br/>";
                for(i = 0;i < content.length;i++){
                    strcontent = strcontent + content[i];
                    strcontent = strcontent + "<br/>";
                }

               //console.log(plant + "表示" + sense + "的诗句有：" + "\n" + content);
                //return plant + "表示" + sense + "的诗句有：" + strcontent;
                return "dddd";
            }
        }*/

        tooltip : {
            trigger: 'axis',
            axisPointer: {
                type: "cross",
                label: {
                    formatter: function (params) {
                        if (params.seriesData.length === 0) {
                            window.mouseCurValue = params.value;
                        }
                    }
                }
            },
            formatter: function (params) {
                let res = "", sum = 0;
                for (let i = 0; i < params.length; i++) {
                    var j;
                    let series = params[i];
                    sum += Number(series.data);
                    if (sum >= window.mouseCurValue) {
                        res = series.axisValue + "<br/>" + series.marker + series.seriesName + ":" + series.data + "<br/>";
                        plant = series.axisValue;
                        sense = series.seriesName;
                        content = poets_dataset[plant][sense];
                        strcontent="<br/>";
                        for( j = 0;j < content.length;j++){
                            strcontent = strcontent + content[j];
                            strcontent = strcontent + "<br/>";
                        }
                        if (j > 0)
                            res = res +"<br/>"+plant + "表示" + sense + "的诗句有："+strcontent;
                        break;
                    }
                }
                return res;
            },
        },
    /*图例，颜色*/
    legend: {
        orient: "vertical",
        left: "90%",
        bottom: "5%",
        textStyle: {
            fontStyle: "normal",
            fontWeight: "normal",
            fontSize: 10,
        },
        itemWidth: 18,
        data: ['爱情', '赞美', '友情', '励志', '闲适', '抒怀', '思乡', '思念', '送别', '孤寂', '愁苦', '忧国忧民', '咏史怀古', '壮志难酬', '讽刺'],
        /*selected: {
            '爱情':false,
            '赞美':false,
            '友情':false,
            '励志':false,
            '闲适':false,
            '抒怀':false,
            '思乡':false,
            '思念':false,
            '送别':false,
            '孤寂':false,
            '愁苦':false,
            '忧国忧民':false,
            '咏史怀古':false,
            '壮志难酬':false,
            '讽刺':false
        }*/
    },
    /*图的位置*/
    grid: {
        left: '3%',
        right: '4%',
        bottom: '3%',
        containLabel: true,
        width: "85%"
    },
    yAxis: {
        type: 'value'
    },
    /*改成植物数据*/
    xAxis: {
        type: 'category',
        data: ['芦苇', '大麻', '稷', '菊花', '枫', '稻', '藜', '桐花', '梧桐', '白茅', '香蒲', '地钱', '梅', '竹', '桑树', '肉桂', '木樨', '泽兰', '梁', '飞蓬', '莲', '茶', '杨树', '李', '柳树'],
        axisLine: {
            show: false
        },
        axisTick: {
            show: false
        },
    },
    /*一个情感对应一个{}*/
    series: [
        {
            name: '爱情',
            type: 'bar',
            stack: 'total',
            label: {
                show: false
            },
            emphasis: {
                focus: 'series'
            },
            data: [1, 0, 0, 0, 1, 0, 1, 1, 2, 0, 1, 1, 2, 3, 0, 4, 4, 5, 5, 6, 18, 3, 8, 5, 9]
        },
        {
            name: '赞美',
            type: 'bar',
            stack: 'total',
            label: {
                show: false
            },
            emphasis: {
                focus: 'series'
            },
            data: [0, 1, 1, 1, 0, 1, 3, 1, 2, 1, 4, 0, 4, 5, 3, 2, 2, 9, 5, 3, 5, 7, 6, 9, 10]
        },
        {
            name: '友情',
            type: 'bar',
            stack: 'total',
            label: {
                show: false
            },
            emphasis: {
                focus: 'series'
            },
            data: [0, 2, 1, 3, 1, 3, 1, 4, 3, 6, 1, 3, 2, 0, 5, 7, 7, 4, 10, 6, 5, 8, 8, 22, 13]
        },
        {
            name: '励志',
            type: 'bar',
            stack: 'total',
            label: {
                show: false
            },
            emphasis: {
                focus: 'series'
            },
            data: [0, 1, 3, 2, 1, 1, 0, 1, 1, 1, 2, 3, 2, 3, 1, 1, 1, 3, 1, 6, 3, 4, 3, 9, 3]
        },
        {
            name: '闲适',
            type: 'bar',
            stack: 'total',
            label: {
                show: false
            },
            emphasis: {
                focus: 'series'
            },
            data: [1, 0, 1, 0, 1, 1, 0, 1, 1, 4, 5, 1, 1, 3, 0, 0, 0, 2, 1, 0, 6, 6, 1, 3, 3]
        },
        {
            name: '抒怀',
            type: 'bar',
            stack: 'total',
            label: {
                show: false
            },
            emphasis: {
                focus: 'series'
            },
            data: [1, 2, 2, 6, 1, 3, 6, 3, 2, 1, 3, 5, 5, 7, 4, 4, 4, 2, 5, 5, 6, 7, 5, 7, 19]
        },
        {
            name: '思乡',
            type: 'bar',
            stack: 'total',
            label: {
                show: false
            },
            emphasis: {
                focus: 'series'
            },
            data: [2, 2, 0, 3, 2, 0, 0, 0, 1, 2, 2, 2, 5, 0, 4, 3, 3, 3, 1, 4, 3, 6, 5, 1, 18]
        },
        {
            name: '思念',
            type: 'bar',
            stack: 'total',
            label: {
                show: false
            },
            emphasis: {
                focus: 'series'
            },
            data: [2, 0, 0, 2, 3, 1, 0, 5, 3, 0, 0, 5, 5, 2, 2, 4, 4, 4, 3, 3, 3, 4, 6, 3, 12]
        },
        {
            name: '送别',
            type: 'bar',
            stack: 'total',
            label: {
                show: false
            },
            emphasis: {
                focus: 'series'
            },
            data: [3, 3, 2, 1, 4, 3, 7, 1, 2, 3, 2, 0, 4, 4, 5, 11, 11, 7, 10, 17, 15, 17, 25, 31, 52]
        },
        {
            name: '孤寂',
            type: 'bar',
            stack: 'total',
            label: {
                show: false
            },
            emphasis: {
                focus: 'series'
            },
            data: [0, 0, 2, 2, 2, 2, 1, 5, 4, 2, 4, 5, 2, 3, 0, 5, 5, 0, 3, 1, 4, 1, 5, 2, 10]
        },
        {
            name: '愁苦',
            type: 'bar',
            stack: 'total',
            label: {
                show: false
            },
            emphasis: {
                focus: 'series'
            },
            data: [1, 0, 0, 2, 1, 0, 1, 5, 3, 2, 1, 4, 4, 2, 2, 2, 2, 3, 6, 4, 6, 7, 8, 10, 17]
        },
        {
            name: '忧国忧民',
            type: 'bar',
            stack: 'total',
            label: {
                show: false
            },
            emphasis: {
                focus: 'series'
            },
            data: [1, 5, 3, 3, 4, 7, 4, 0, 3, 6, 2, 1, 1, 3, 11, 0, 0, 2, 7, 8, 2, 7, 4, 6, 7]
        },
        {
            name: '咏史怀古',
            type: 'bar',
            stack: 'total',
            label: {
                show: false
            },
            emphasis: {
                focus: 'series'
            },
            data: [2, 3, 6, 0, 5, 2, 0, 1, 2, 1, 1, 2, 3, 2, 2, 5, 5, 9, 12, 5, 3, 8, 6, 4, 10]
        },
        {
            name: '壮志难酬',
            type: 'bar',
            stack: 'total',
            label: {
                show: false
            },
            emphasis: {
                focus: 'series'
            },
            data: [1, 2, 1, 0, 0, 2, 3, 1, 1, 2, 2, 3, 0, 4, 4, 4, 4, 2, 4, 4, 4, 4, 3, 3, 6]
        },
        {
            name: '讽刺',
            type: 'bar',
            stack: 'total',
            label: {
                show: false
            },
            emphasis: {
                focus: 'series'
            },
            data: [2, 1, 2, 0, 0, 2, 2, 1, 1, 0, 2, 2, 0, 2, 8, 1, 1, 3, 0, 6, 7, 6, 5, 5, 7],
            barMaxWidth: 15,
            barCateGoryGap: 10
        }
    ]
};

mychart.on('click',function(params){
    plant = params.name;
    sense = params.seriesName;

    
});
mychart.setOption(option);